{
  "intents": [
    {
      "tag": "greetings",
      "patterns": [
        "hey",
        "up 's what ?",
        "'s ? up what",
        "going is how it ?",
        "? how is it going",
        "what's up?",
        "up ? what 's",
        "what ? 's up",
        "hi",
        "day good",
        "hello",
        "how is it going?",
        "? going how is it",
        "? going is it how",
        "good day",
        "Greetings"
      ],
      "responses": [
        "Hello!",
        "Hey!",
        "What can I do for you?"
      ]
    },
    {
      "tag": "invalid",
      "patterns": [
        "",
        "adacdva",
        "hsfdjshsh"
      ],
      "responses": [
        "Sorry, I didn't get you",
        "Please try again",
        "I didn't understand"
      ]
    },
    {
      "tag": "name",
      "patterns": [
        "what I call you should",
        "are you who",
        "what is your name",
        "your name 's what",
        "is what name your",
        "name",
        "who are you",
        "'s name what your",
        "is name your what",
        "who you are",
        "is what your name",
        "I call should you what",
        "what's your name",
        "name your what is",
        "I you what call should",
        "what should I call you",
        "I what should you call",
        "what 's your name",
        "name your 's what",
        "I should call what you"
      ],
      "responses": [
        "You can call me VAJRAS",
        "I'm VAJRAS",
        "I'm VAJRAS your virtual assistant"
      ]
    },
    {
      "tag": "developer",
      "patterns": [
        "is your who mother",
        "created who you",
        "creator is who your",
        "who is creator your",
        "who is your developer",
        "your developer who is",
        "who your mother is",
        "mother is who your",
        "who developed you",
        "who you created",
        "father your who is",
        "who is your father",
        "is your who developer",
        "father is who your",
        "who created you",
        "who is your creator",
        "father who is your",
        "your who mother is",
        "your who creator is",
        "is who creator your",
        "your is who creator",
        "who father your is",
        "your father who is",
        "who your developer is",
        "you developed who",
        "who is your mother",
        "your mother who is",
        "created you who"
      ],
      "responses": [
        "VAJRAS - Virtual Assistant for JSSSTU is developed by Vinodraj, Aditya, Janapriya, sudharshan Reddy And Satwik"
      ]
    },
    {
      "tag": "csHOD",
      "patterns": [
        "of HOD science who is computer the",
        "the is CS HOD Who",
        "Who is the HOD CS",
        "HOD of who CS the department is",
        "who is the HOD of CS department",
        "who HOD the of science computer is",
        "HOD department of who is CS the",
        "CS of Name HOD",
        "who is the HOD of computer science department",
        "who HOD is the science computer of",
        "Name of HOD CS",
        "HOD of Name CS",
        "is CS of HOD the who department",
        "department who CS the of HOD is",
        "who computer is department HOD of the science",
        "is the CS Who HOD",
        "Who is the CS HOD",
        "is department the science who HOD computer of",
        "department is of who computer the HOD science",
        "of HOD Name CS",
        "department is who HOD the of computer science",
        "who is the HOD of computer science",
        "Name of CS HOD",
        "of CS is department who HOD the",
        "HOD is CS Who the",
        "HOD Who the is CS",
        "science who is HOD computer of the",
        "who HOD computer the department science of is",
        "the HOD science computer of who is"
      ],
      "responses": [
        "HOD of CS dept is Dr. Srinath.S",
        "The Name of CS HOD is Dr. Srinath.S",
        "The Head of The Department of CS in JSSSTU is Dr. Srinath.S"
      ]
    },
    {
      "tag": "principal",
      "patterns": [
        "of is name the principal What college the",
        "the name of What is principal the college",
        "the of name What the college is principal",
        "Who the SJCE principal of is",
        "Who of SJCE is principal the",
        "Who is the principal of SJCE",
        "Who is the principal of JSSSTU",
        "Who the JSSSTU of is principal",
        "of principal Who JSSSTU the is",
        "principal JSSSTU the is of Who",
        "is Principal our College Who",
        "of principal the Who is SJCE",
        "What is the name of the college principal",
        "Who our is College Principal",
        "Who principal is JSSSTU of the",
        "Who our Principal is College",
        "Principal is our Who College",
        "Who is our College Principal",
        "College is Who our Principal",
        "SJCE of the principal is Who",
        "the principal is of SJCE Who",
        "the college of is name What the principal",
        "Who principal is of the JSSSTU",
        "name the What of is principal college the"
      ],
      "responses": [
        "Our College Principal is C. Nataraju",
        "The college principal's name is C. Nataraju",
        "C. Nataraju is the principal of SJCE",
        "C. Nataraju is the principal of JSSSTU"
      ]
    },
    {
      "tag": "Location",
      "patterns": [
        "the of college what the location is",
        "is what college the the location of",
        "location",
        "what the of the college location is",
        "is where it located",
        "where is it located",
        "it is located where",
        "is college the what location of the",
        "college of is the what the location",
        "what is the location of the college",
        "located is where it",
        "is located it where"
      ],
      "responses": [
        "Manasagangotri Layout,Mysuru",
        "College is located in University of Mysore Campus,Manasagangotri,Mysuru"
      ]
    },
    {
      "tag": "website",
      "patterns": [
        "the college what is website of the",
        "Give me the college Website",
        "college me the Website Give",
        "the college website what the of is",
        "what is the website of the college",
        "Give Website me college the",
        "website of the college",
        "college Give the Website me",
        "the college Give me Website",
        "is the college of what the website",
        "college of what is the the website",
        "college is what the of the website",
        "website",
        "college website the of",
        "college Give me the Website",
        "the website college of",
        "college the of website"
      ],
      "responses": [
        "https://jssstuniv.in/#/"
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "JSSSTU of the number is contact what",
        "contact number of Give JSSSTU",
        "of number give contact SJCE",
        "what is the contact number of JSSSTU",
        "Give contact number of JSSSTU",
        "what is the contact number of the college",
        "of SJCE number is the contact what",
        "is the JSSSTU of what number contact",
        "of college what the number the contact is",
        "what is the contact number of SJCE",
        "the is contact number SJCE what of",
        "contact college number what of the is the",
        "number of contact what college the is the",
        "of number JSSSTU contact Give",
        "SJCE give contact of number",
        "is SJCE of what contact the number",
        "number Give contact of JSSSTU",
        "contact what of JSSSTU the number is",
        "college what the is of the contact number",
        "of Give number JSSSTU contact",
        "JSSSTU Give of contact number",
        "SJCE give contact number of",
        "give number of contact SJCE",
        "is what the of contact number JSSSTU",
        "give SJCE number of contact",
        "contact",
        "contact the of what number is SJCE",
        "give contact number of SJCE",
        "the SJCE contact of number what is",
        "JSSSTU the what number contact is of",
        "the number contact of what is the college"
      ],
      "responses": [
        "The contact number of SJCE,JSSSTU is 0821-2548285",
        "0821-2548285 is the contact number of SJCE,JSSSTU",
        "The contact number of JSSSTU is 0821-2548286"
      ]
    },
    {
      "tag": "email",
      "patterns": [
        "the what of email the college is",
        "what of email JSSSTU the is",
        "of email Give JSSSTU",
        "Give email of JSSSTU",
        "the email SJCE of what is",
        "give email of SJCE",
        "email what of SJCE the is",
        "email SJCE of give",
        "email of JSSSTU Give",
        "email",
        "is JSSSTU of what email the",
        "email is of the the what college",
        "the what email JSSSTU of is",
        "what the the email is college of",
        "email of Give JSSSTU",
        "of what the email JSSSTU is",
        "of college the email what is the",
        "email of SJCE give",
        "the email is of JSSSTU what",
        "of SJCE give email",
        "what the email is SJCE of",
        "what is the email of the college",
        "what is the email of SJCE",
        "JSSSTU of Give email",
        "email give SJCE of",
        "is email the what SJCE of",
        "give email SJCE of",
        "what is the email of JSSSTU",
        "is of email what college the the",
        "email the SJCE is what of"
      ],
      "responses": [
        "The email of SJCE,JSSSTU is enquire@jssstuniv.in",
        "enquire@jssstuinv.in is the email of SJCE,JSSSTU"
      ]
    },
    {
      "tag": "semestersBE",
      "patterns": [
        "of How semesters number BE in many",
        "what is number of semesters in BE",
        "in How semesters BE many number of",
        "of semesters in number BE",
        "How many semesters are in of Engineering engineering there Bachelor in",
        "How many number of semesters in BE",
        "number semesters of in BE",
        "of in number BE semesters",
        "semesters many in How in there are of engineering Bachelor Engineering",
        "semesters in How of BE number many",
        "in BE number of semesters",
        "of in number what BE is semesters",
        "in many Bachelor of are semesters there Engineering How in engineering",
        "BE what number in semesters is of",
        "many of number How semesters in BE",
        "of what semesters BE is number in",
        "How many semesters are there in engineering in Bachelor of Engineering",
        "number of semesters in BE",
        "Engineering Bachelor in there of engineering are semesters in How many",
        "is of semesters in what number BE",
        "engineering in in How many Engineering semesters there of are Bachelor",
        "of semesters in BE number",
        "semesters BE number of How in many",
        "BE semesters number in of is what"
      ],
      "responses": [
        "There are 8 Semesters in engineering in BE",
        "BE Course has 8 semesters"
      ]
    },
    {
      "tag": "numCircuitBranches",
      "patterns": [
        "circuit branches of what branch is number in",
        "branch number of in branches circuit",
        "is circuit what in branches branch of number",
        "of branches circuit in number branch",
        "How many branch in are there branches circuit",
        "in of branches circuit branch number",
        "branch circuit in what of is number branches",
        "branches branch number of circuit in",
        "circuit number in is branches of what branch",
        "How many branch in circuit branches are there",
        "branches circuit number in of branch",
        "in are there How circuit many branches branch",
        "there many branches circuit How branch are in",
        "what circuit branches branch number in of is",
        "branch are branches many How in circuit there",
        "many in there are branch branches How circuit",
        "How many branches are there in circuit branch",
        "branch many in branches circuit there are How",
        "what is number of branches in circuit branch",
        "many in branch How circuit there branches are",
        "are branch circuit How many branches there in",
        "How there in circuit branches branch are many",
        "number of branches in circuit branch"
      ],
      "responses": [
        "There are 6 branches in circuit branch",
        "Circuit branch has 6 branches"
      ]
    },
    {
      "tag": "numNonCircuitBranches",
      "patterns": [
        "of branches in number circuit is what non branch",
        "branches number circuit of non is what in branch",
        "How branches many circuit non there are branch in",
        "is number of branches branch circuit non in what",
        "How many branches are there in non circuit branch",
        "many there non circuit How are in branches branch",
        "non number branch in circuit branches of",
        "what is number of branches in non circuit branch",
        "circuit branches are non there branch in How many",
        "in branch what branches of number non circuit is",
        "in branch of number non circuit branches",
        "How circuit branches are many in branch there non",
        "non in How there circuit are many branches branch",
        "number of branches in non circuit branch",
        "in are How non circuit branch branches there many",
        "there are branches How in circuit branch many non",
        "in branch circuit non of number branches",
        "are non many branch in How there circuit branches",
        "branch number branches circuit non of in",
        "non are there branches How many branch in circuit",
        "number branch non of in circuit branches",
        "what circuit in non branches number branch is of",
        "many non branches How circuit in are branch there"
      ],
      "responses": [
        "There are 7 branches in non circuit branch",
        "Non Circuit branch has 7 branches"
      ]
    },
    {
      "tag": "ISHOD",
      "patterns": [
        "is What hod ise name the the of",
        "is ise hod the name What the of",
        "the department jssstu who of ise in head of is",
        "of who jssstu ise in is hod the",
        "Who the of ise hod dept is",
        "who is the hod of ise in jssstu ",
        "is name the hod What of ise the",
        "ise of department branch in Name head the",
        "Who is the hod of ise dept",
        "Name the head of department in ise branch",
        "is the of department in who of head ise jssstu",
        "the What ise of hod the is name",
        "What is the name of the ise hod",
        "Name of ise head branch department in the",
        "the head of department ise Name in branch",
        "who department is head jssstu of of ise the in",
        "of hod ise the dept Who is",
        "is of in who jssstu the hod ise",
        "who is the head of department of ise in jssstu",
        "of hod jssstu in who is ise the",
        "ise hod is of What the the name",
        "in ise of jssstu who is the hod",
        "hod dept ise the is Who of",
        "is the jssstu in hod of who ise",
        "in department ise of head branch the Name",
        "head department in who is of of jssstu the ise",
        "is Who hod the dept ise of",
        "is ise jssstu of head in of who department the",
        "in head of branch department Name ise the",
        "dept is hod of the Who ise"
      ],
      "responses": [
        "Dr. B S Mahanand is the HOD of ISE dept",
        "Dr. B S Mahanand is the Head Of Department of ISE in JSSSTU"
      ]
    },
    {
      "tag": "BECredits",
      "patterns": [
        "number of is credits BE what in",
        "number of BE credits in",
        "BE in credits of number",
        "what is number of credits in BE",
        "in credits BE number of",
        "credits number in of BE is what",
        "credits of in number what BE is",
        "number of credits in BE",
        "in of credits what number BE is",
        "credits How there BE are many in",
        "in there credits are BE many How",
        "How are there credits many in BE",
        "in of BE credits number",
        "credits many BE there How in are",
        "BE many How credits in are there",
        "How many credits are there in BE",
        "number credits is in of BE what",
        "in there are How credits many BE",
        "are How credits BE many there in",
        "there are in BE credits How many",
        "number in BE credits of",
        "credits there BE How are in many",
        "credits many there are BE in How"
      ],
      "responses": [
        "There are 175 credits in BE",
        "BE Course has 175 credits"
      ]
    },
    {
      "tag": "aidedCETCode",
      "patterns": [
        "code of in give the college cet qouta aided your",
        "What is the cet code of aided qouta in jssstu",
        "give the cet code of aided qouta in your college",
        "what is cet code of aided qouta in your college",
        "cet code of aided qouta",
        "cet aided of qouta code",
        "code What aided is in the jssstu qouta of cet",
        "code aided qouta cet of",
        "cet qouta college in give code your aided of the",
        "of aided give in qouta cet code college the your",
        "your aided in qouta cet of college code the give",
        "the qouta jssstu code cet What in of is aided",
        "is cet qouta code in what your aided college of",
        "is of your college in what code cet aided qouta",
        "college is aided of cet in code your qouta what",
        "what aided is college your code in qouta of cet",
        "qouta is college what your in code cet aided of",
        "aided cet qouta of code",
        "the of What is jssstu in cet aided qouta code",
        "cet in qouta What is jssstu of aided code the",
        "code cet aided of qouta",
        "aided of qouta cet code",
        "aided the qouta code of cet What jssstu in is",
        "your code qouta cet in the of college give aided"
      ],
      "responses": [
        "The CET code of aided qouta in JSSSTU is E021",
        "E021 is the cet code of aided qouta in JSSSTU"
      ]
    },
    {
      "tag": "unaidedCETCode",
      "patterns": [
        "qouta of cet unaided code",
        "your give college unaided code the cet of in qouta",
        "in give college the unaided code of your cet qouta",
        "jssstu is in the of unaided What qouta code cet",
        "in qouta of code unaided jssstu is cet the What",
        "is of What unaided the qouta cet in jssstu code",
        "unaided What code the cet of qouta is in jssstu",
        "your code college unaided the cet qouta of give in",
        "cet code of unaided qouta",
        "of cet the give college qouta your unaided in code",
        "college in your code unaided the of cet qouta give",
        "qouta unaided cet of code",
        "code unaided qouta college what your cet is of in",
        "of is cet unaided what college qouta your in code",
        "college is in of unaided cet what qouta code your",
        "give the cet code of unaided qouta in your college",
        "what is cet code of unaided qouta in your college",
        "of cet qouta code unaided",
        "qouta of what is your cet unaided in college code",
        "qouta code cet unaided of",
        "qouta in cet code unaided is your what of college",
        "qouta code cet of unaided",
        "unaided jssstu in cet What code is qouta of the",
        "What is the cet code of unaided qouta in jssstu"
      ],
      "responses": [
        "The CET code of unaided qouta in JSSSTU is E057 and E284",
        "E057 and E284 is the cet code of unaided qouta in JSSSTU"
      ]
    },
    {
      "tag": "numCSFaculty",
      "patterns": [
        "faculty CS number department in of",
        "department there faculty are many How CS in",
        "is in number department faculty what of CS",
        "number cse is sjce dapartment in in the what of faculty",
        "the of handling college faculty jss in cse dept Number",
        "there department How CS are many faculty in",
        "handling college faculty Number the jss dept cse of in",
        "in CS are How many faculty department there",
        "the science number branch of in what computer faculty is",
        "How many faculty members are handling the cse department ",
        "computer the of in number science branch faculty what is",
        "of is branch in science number faculty what computer the",
        "of jss the cse dept handling faculty Number in college",
        "is faculty dapartment of sjce in what the number cse in",
        "many there faculty in department How are CS",
        "faculty CS in of department number",
        "Number of faculty handling the cse dept in jss college ",
        "cse department members the How are faculty many handling",
        "jss cse the of faculty dept in college Number handling",
        "faculty of department what CS is in number",
        "is number CS in what department of faculty",
        "of what is department number CS faculty in",
        "faculty CS are there How in department many",
        "of branch is science the in computer number what faculty",
        "what is the number of faculty in computer science branch",
        "dapartment what the is number sjce faculty of cse in in",
        "what is number of faculty in CS department",
        "number the dapartment cse is sjce what in in faculty of",
        "number department in of CS faculty",
        "many How faculty department are the cse handling members",
        "How many faculty are there in CS department",
        "faculty number department CS in of",
        "what is the number of faculty in cse dapartment in sjce",
        "handling department faculty many cse members are How the",
        "are there CS faculty department many in How",
        "the department are cse faculty many How handling members",
        "sjce of is in cse dapartment in what number faculty the",
        "are department faculty many CS How in there",
        "faculty How in department there CS many are",
        "faculty How there CS are many in department",
        "How are cse handling members department faculty many the",
        "of what number department in CS is faculty",
        "branch number what the is of science computer in faculty",
        "number of faculty in CS department",
        "of cse faculty the handling in college dept Number jss",
        "are department in How CS there many faculty",
        "of number in department CS faculty"
      ],
      "responses": [
        "There are 32 faculty in CS department",
        "CS department has 32 faculty",
        "Number of faculty working the CS Department in our college is 32",
        "The number of faculty in Computer science branch is 32"
      ]
    },
    {
      "tag": "numCSIntake",
      "patterns": [
        "in mysuru What CSE SJCE branch of intake is the",
        "What of branch is mysuru the CSE JSSSTU intake college in",
        "2023 cse intake jss of number in engineering of",
        "intake of cse jss 2023 in of engineering number",
        "college branch CSE mysuru JSSSTU the What in of is intake",
        "mysuru branch in CSE of intake is SJCE the What",
        "college What branch JSSSTU is of CSE in mysuru the intake",
        "students intake the cse of of total branch in number what is in jssstu",
        "engineering intake number cse in of of 2023 jss",
        "in branch the jssstu students cse of intake total number is in what of",
        "CSE What mysuru is SJCE branch of intake in the",
        "intake What branch the SJCE is CSE of mysuru in",
        "What is the intake of CSE branch in JSSSTU college mysuru",
        "what is the total number of intake of students in cse branch in jssstu",
        "intake engineering cse of of number jss in 2023",
        "in of the what branch cse number intake in jssstu total students is of",
        "engineering cse of number in intake of jss 2023",
        "in students of what the is total cse intake branch of jssstu in number",
        "JSSSTU intake CSE What the branch college mysuru of is in",
        "What is the intake of CSE branch in SJCE mysuru",
        "SJCE CSE mysuru the What intake of is branch in",
        "number of intake of cse in jss engineering 2023",
        "cse what jssstu the total number in students in of intake branch of is",
        "is intake branch What JSSSTU the mysuru college in of CSE"
      ],
      "responses": [
        "The intake of CSE branch in our college is 300",
        "The intake of CSE branch in SJCE Mysuru is 300",
        "300 is the intake of CSE in JSSSTU 2023"
      ]
    },
    {
      "tag": "IIRFrank",
      "patterns": [
        "IIRF What the rank sjce level 2023 of in is state mysuru",
        "mysuru 2023 sjce state hold does IIRF level in rank which per as",
        "state in IIRF mysuru of 2023 the rank sjce is level What",
        "mysuru 2023 level in the of as state IIRF sjce number per rank",
        "which rank does sjce mysuru hold as per IIRF 2023 in state level",
        "IIRF rank What sjce mysuru 2023 of is state level in the",
        "rank sjce does which hold as in mysuru per 2023 IIRF state level",
        "number the rank of sjce mysuru as per IIRF 2023 in state level",
        "number is what per 2023 state IIRF rank the in level as of of jssstu",
        "What is the IIRF 2023 rank of sjce mysuru in state level",
        "in of mysuru the state level rank IIRF sjce 2023 is What",
        "rank mysuru hold does in which per as state sjce 2023 level IIRF",
        "number as of the level per mysuru in IIRF rank 2023 state sjce",
        "rank mysuru 2023 in the IIRF What level state of is sjce",
        "IIRF jssstu of in as is the per level rank number of what 2023 state",
        "2023 state level as jssstu is of in of number rank what per the IIRF",
        "as the of of number 2023 IIRF what jssstu rank per level is in state",
        "hold rank as state per in does level mysuru IIRF which sjce 2023",
        "rank per is in state the what of as of level jssstu 2023 number IIRF",
        "IIRF does state 2023 rank which mysuru sjce in hold per as level",
        "as level the mysuru rank number per of sjce 2023 state IIRF in",
        "what is the number of rank of jssstu in state level as per IIRF 2023",
        "of state as per rank the IIRF level mysuru number sjce 2023 in",
        "in sjce rank of as IIRF state number 2023 level mysuru per the"
      ],
      "responses": [
        "The IIRF 2023 Ranking of SJCE Mysuru at State level is 5th",
        "Fifth rank as per IIRF 2023 at State level"
      ]
    },
    {
      "tag": "collegeRegistrar",
      "patterns": [
        "is jssstu the who of registrar",
        "jssstu registrar is who the of",
        "sjce the is registrar who of mysuru",
        "college jss engineering who registrar mysuru the of is of",
        "of engineering the registrar of is college jss mysuru who",
        "is registrar of jssstu who the",
        "college jss registrar engineering of is who the mysuru",
        "of jss engineering mysuru who college is of the registrar",
        "registrar jssstu who the of is",
        "is who the of sjce mysuru registrar",
        "who is the registrar of sjce mysuru",
        "is of mysuru registrar who the sjce",
        "the of registrar sjce is mysuru who",
        "who is the registrar of jssstu",
        "the of registrar jss who mysuru engineering college of is",
        "is who mysuru engineering the of registrar jss college",
        "mysuru registrar the is of who college engineering jss",
        "who is the registrar of jss college of engineering mysuru",
        "jssstu the who of is registrar",
        "who is the registrar of jss engineering college mysuru",
        "sjce mysuru of the is registrar who",
        "of of registrar is jss engineering who mysuru college the",
        "the is engineering of mysuru who jss registrar college",
        "of engineering registrar is mysuru college jss who the"
      ],
      "responses": [
        "Our College registrar is Dr.S.A.Dhanaraj",
        "The college registrar's name is Dr.S.A.Dhanaraj",
        "Dr.S.A.Dhanaraj is the registrar of JSSSTU"
      ]
    },
    {
      "tag": "collegeChancellor",
      "patterns": [
        "College is Who our chancellor",
        "Who is our College chancellor",
        "of chancellor who mysuru is the sjce",
        "Who College our chancellor is",
        "chancellor college the is the of What name",
        "the jssstu of who is chancellor",
        "jssstu is chancellor the of who",
        "the Who JSSSTU is of chancellor",
        "who is the chancellor of sjce mysuru",
        "name chancellor the What the of is college",
        "of jssstu the chancellor who is",
        "is the of JSSSTU chancellor Who",
        "College Who our is chancellor",
        "of JSSSTU is the chancellor Who",
        "the is college chancellor the name of What",
        "who is the chancellor of jss college of engineering mysuru",
        "SJCE chancellor Who is of the",
        "our Who is College chancellor",
        "who chancellor is college mysuru the jss engineering of",
        "who the of is mysuru sjce chancellor",
        "Who chancellor SJCE is of the",
        "of the mysuru chancellor is jss of who college engineering",
        "is college the who engineering of chancellor of mysuru jss",
        "College our chancellor Who is",
        "jssstu who is chancellor of the",
        "chancellor is the SJCE Who of",
        "the of who is chancellor mysuru sjce",
        "Who chancellor is SJCE of the",
        "the Who chancellor is SJCE of",
        "mysuru who is college engineering the jss of chancellor of",
        "Who is the chancellor of JSSSTU",
        "of engineering jss is mysuru of the chancellor college who",
        "name the the of What college chancellor is",
        "What is the name of the college chancellor",
        "who the chancellor of college engineering is mysuru jss",
        "is JSSSTU of chancellor Who the",
        "chancellor of the name the college is What",
        "mysuru of the chancellor sjce is who",
        "who is the chancellor of jss engineering college mysuru",
        "jss who is chancellor college of engineering the mysuru",
        "chancellor is mysuru who college engineering of jss of the",
        "who is the chancellor of jssstu",
        "JSSSTU chancellor of is Who the",
        "college of the mysuru chancellor jss who engineering is",
        "Who is the  chancellor of SJCE",
        "who is the sjce chancellor mysuru of",
        "jss college mysuru of chancellor the is who engineering",
        "of the chancellor who jssstu is"
      ],
      "responses": [
        "Our College chancellor is Sri Shivaratri Deshikendra Swamiji",
        "The college chancellor's name is Sri Shivaratri Deshikendra Swamiji",
        "Sri Shivaratri Deshikendra Swamiji is the chancellor of JSSSTU"
      ]
    },
    {
      "tag": "collegearea",
      "patterns": [
        "area the is what of mysuru sjce",
        "the of mysuru area of jssstu",
        "what is the area of jss engineering college in mysuru",
        "mysuru of what the college is engineering jss area",
        "is jss the what mysuru engineering of area college",
        "area sjce what of is mysuru the",
        "college the of what area the is",
        "of mysuru sjce what area the is",
        "name the number of acres of area of sjce mysuru",
        "of mysuru jssstu of the area",
        "engineering is what of mysuru the jss college area of",
        "mysuru area jss what college engineering the of is in",
        "the area of jssstu of mysuru",
        "of what is area the college the",
        "what is the area of jss college of engineering mysuru",
        "of area mysuru of of name the acres number sjce",
        "acres mysuru area of number sjce name the of of",
        "is engineering mysuru college jss of the area in what",
        "mysuru of sjce area the what is",
        "the mysuru engineering what college is area jss of",
        "of the what is sjce mysuru area",
        "mysuru engineering of college of area jss what the is",
        "of mysuru is area what the sjce",
        "what of in engineering college the mysuru area is jss",
        "the is jssstu what of area",
        "is what sjce the of area mysuru",
        "in is the jss engineering mysuru of area what college",
        "mysuru of of acres the number sjce name of area",
        "what is the area of the college",
        "area mysuru is engineering jss of the what college of",
        "mysuru area jssstu of of the",
        "area is the jssstu of what",
        "sjce what area of the mysuru is",
        "jss engineering area is college the mysuru what of",
        "what is the area of jss engineering college mysuru",
        "college the area the is of what",
        "of jssstu the is area what",
        "of the what area jssstu is",
        "of mysuru of the area jssstu",
        "engineering what mysuru college area jss the is of",
        "the college is of area the what",
        "the what area is jssstu of",
        "what is the area of sjce mysuru",
        "number area of name of sjce acres of mysuru the",
        "what is the area of jssstu",
        "mysuru the area sjce of what is",
        "sjce the area of mysuru is what",
        "of of mysuru of the area acres name sjce number",
        "what the area college engineering is jss of of mysuru",
        "is engineering what jss of area of the mysuru college",
        "area jssstu mysuru of the of",
        "the what the area college is of",
        "engineering the in area college of jss mysuru is what"
      ],
      "responses": [
        "The area of SJCE Mysuru is 102 acres",
        "Our University is spread over 102 acres of land"
      ]
    },
    {
      "tag": "founder",
      "patterns": [
        "who is the founder of jssstu",
        "mysuru of engineering founder is college jss who the",
        "of college founder engineering jss is the mysuru of who",
        "the of JSS name founder",
        "of founder name the JSS",
        "who is the jss engineering of mysuru college founder",
        "of college founder jss of the mysuru is engineering who",
        "founder the of is who JSS",
        "name JSS founder the of",
        "is founder who JSS the of",
        "name the JSS founder of",
        "is name of founder the of JSS what",
        "the who of is JSS founder",
        "college who of is founder engineering the jss mysuru of",
        "jss of is founder the college of engineering mysuru who",
        "who is the founder of jss college of engineering mysuru",
        "the founder is of jssstu who",
        "founder the of what of name is JSS",
        "who of is founder engineering mysuru of jss the college",
        "jss founder the engineering college who mysuru of is",
        "who is the founder of JSS",
        "who the is of jssstu founder",
        "is college mysuru engineering jss who founder of the",
        "of of the name JSS what founder is",
        "jssstu who the is founder of",
        "who of founder is the JSS",
        "JSS of founder is who the",
        "who is the founder of jss engineering college mysuru",
        "mysuru jss engineering college founder is the who of",
        "name the founder of JSS",
        "who founder of is jssstu the",
        "what is the name of founder of JSS",
        "the of what founder JSS is of name",
        "name of JSS of the founder what is",
        "who jssstu of is founder the",
        "founder of JSS the name"
      ],
      "responses": [
        "Sri Sri Sri Dr. Shivarathri Rajendra Mahaswamiji is the founder of JSS"
      ]
    },
    {
      "tag": "Ecell",
      "patterns": [
        "any targeted or programs offer SJCE specifically ? resources startup towards Does initiatives fostering",
        "Does SJCE offer any resources or programs specifically targeted towards fostering startup initiatives?",
        "Are there any existing successful student startups launched through SJCE that exemplify the campus's startup culture?",
        "How prevalent is entrepreneurial spirit among SJCE students?",
        "support for campus and startups atmosphere What on student is overall the ?",
        "initiatives SJCE towards programs fostering targeted Does or specifically any ? startup resources offer",
        "among entrepreneurial is How ? students prevalent SJCE spirit",
        "initiatives startup any towards SJCE specifically ? targeted fostering or Does offer resources programs",
        "student atmosphere startups the on for What and support overall ? campus is",
        "on and overall ? support campus student is startups atmosphere What for the",
        "initiatives or Does startup any fostering SJCE towards targeted ? offer programs specifically resources",
        "? students is among How prevalent entrepreneurial SJCE spirit",
        "exemplify existing launched 's that any ? startups successful Are SJCE student culture there through startup campus the",
        "? What campus startups overall on for the atmosphere is and student support",
        "entrepreneurial among How prevalent ? is spirit students SJCE",
        "What is the overall atmosphere and support for student startups on campus?",
        "student What is the atmosphere startups campus support and for overall on ?",
        "culture successful launched startups campus 's through ? the startup any existing there SJCE student exemplify that Are",
        "that startups existing exemplify launched 's campus any student SJCE startup through Are there successful the culture ?",
        "prevalent spirit students How SJCE entrepreneurial is ? among",
        "? launched exemplify through SJCE student successful there Are the startups that any startup culture existing 's campus",
        "How entrepreneurial is among SJCE prevalent spirit students ?",
        "campus exemplify through Are successful culture that startups student any ? launched SJCE startup 's existing there the",
        "programs or resources any targeted offer Does initiatives towards startup specifically ? SJCE fostering"
      ],
      "responses": [
        "SJCE boasts a vibrant and supportive startup culture! SJCE-STEP serves as a hub for aspiring entrepreneurs, providing guidance, resources, and opportunities to nurture their ideas.",
        "The entrepreneurial spirit is very much alive at SJCE! Many students embrace innovation and actively pursue their business ventures. The campus buzzes with creative energy and a drive to make a difference.",
        "Yes, SJCE actively encourages and empowers student startups through dedicated programs like SJCE-STEP. They offer workshops, mentorship, funding opportunities, and access to incubation facilities, equipping students with the tools they need to turn their dreams into reality.",
        "SJCE takes pride in its legacy of successful student startups. You'll find inspiring stories of alumni who launched thriving businesses while at SJCE, proving that the campus fosters and celebrates entrepreneurial success."
      ]
    },
    {
      "tag": "eateries",
      "patterns": [
        "campus What the present eateries are in the ?",
        "in What the eateries present are ? the campus",
        "Are ? there options available any late-night food",
        "there any different Are dietary ? options preferences for",
        "dietary ? any preferences options different Are there for",
        "? any late-night there options available Are food",
        "What are the eateries present in the campus?",
        "options dietary ? different there preferences for any Are",
        "present the in campus ? eateries are the What",
        "affordable meals I find ? and on healthy Can campus",
        "options any ? there available Are food late-night",
        "eateries the ? are the in What campus present",
        "campus ? present the are in What eateries the",
        "? dietary any for there preferences Are options different",
        "Are there any late-night food options available?",
        "available late-night there food options any ? Are",
        "Can I find healthy and affordable meals on campus?",
        "campus Can I find ? meals on affordable healthy and",
        "I and healthy meals affordable Can campus on find ?",
        "Are there any options for different dietary preferences?",
        "meals and find on I healthy ? affordable Can campus",
        "? and find on Can I affordable healthy campus meals",
        "available there options Are ? any late-night food",
        "there any ? Are different for dietary preferences options"
      ],
      "responses": [
        "SJCE offers a variety of on-campus eateries dedicated to delicious vegetarian dishes. Popular options include Yampa, known for its authentic South Indian flavors, and Lara's Cafe, serving up a range of creative vegetarian sandwiches, salads, and wraps. You'll also find healthy snacks and drinks at vending machines located throughout campus.",
        "Absolutely! SJCE understands the diverse needs of its students and caters to various dietary preferences. Yampa and other eateries offer vegan-friendly options, while most places can accommodate allergies or other restrictions with prior notice. Don't hesitate to ask!",
        "SJCE prioritizes student well-being and offers healthy, budget-friendly vegetarian meals. The canteen provides daily lunch and dinner menus featuring nutritious dishes like vegetable curries, dal, and salads. You can also grab healthy snacks and smoothies at Lara's Cafe.",
        "No worries about late-night hunger pangs! The vending machines across campus are stocked with snacks and drinks to satisfy your cravings. Additionally, some eateries, like Yampa, may offer extended hours during peak study times."
      ]
    },
    {
      "tag": "stationaries",
      "patterns": [
        "? printing there Are available any ordering online options or",
        "Are color printing printing ? equipped xerox the and for shops",
        "options printing any there ? available or ordering online Are",
        "What facilities these the are operating ? of hours",
        "hours the ? facilities these of are What operating",
        "What are the operating hours of these facilities?",
        "facilities ? hours are operating What these the of",
        "shops equipped and ? xerox the printing printing color for Are",
        "? the campus are stationary as in the as What well facilities xerox and printing",
        "? Are for equipped shops and xerox color printing the printing",
        "campus stationary ? the as as are the facilities in well and What printing xerox",
        "printing ordering online Are any available there ? or options",
        "Are options or ? any online ordering there available printing",
        "these operating ? of What facilities the hours are",
        "Are the printing and xerox shops equipped for color printing?",
        "shops for printing color the equipped and ? printing xerox Are",
        "Are there any online ordering or printing options available?",
        "well in facilities xerox are printing ? the as stationary and the What as campus",
        "? the operating hours facilities of are What these",
        "stationary and well the printing campus facilities are the in xerox ? as as What",
        "stationary printing in as the campus xerox well as are facilities ? What and the",
        "and Are printing the xerox ? equipped printing shops for color",
        "What are the stationary as well as printing and xerox facilities in the campus?",
        "printing there or online available options any ordering ? Are"
      ],
      "responses": [
        "SJCE caters to your academic needs with a convenient stationary shop and three strategically located printing and xerox shops. These facilities offer a wide range of supplies, from notebooks and pens to printing and binding services, ensuring you have everything you need to ace your studies.",
        "Definitely! The printing and xerox shops are equipped with modern technology, allowing you to print and copy in both black and white and vibrant colors. Need high-quality project prints? They've got you covered!",
        "To ensure accessibility, the stationary shop and at least one printing and xerox shop remain open throughout the day, including weekends. The other two shops have extended hours during weekdays to fulfill your last-minute academic needs. Specific timings are conveniently displayed at each location.",
        "Some printing and xerox shops might offer online ordering and printing services for your convenience. Check with the individual shops for their specific services and options. You can also find self-service printing kiosks in certain locations, allowing you to quickly print documents directly from your laptop or phone."
      ]
    },
    {
      "tag": "sportFacilities",
      "patterns": [
        "What some in are the ? campus sport facilities",
        "? What some campus are in the facilities sport",
        "What facilities campus the ? some are in sport",
        "What be the premises within facilities sports ? found kinds campus can of",
        "facilities on the the available sports Enumerate . campus",
        "be can kinds What within found facilities campus the ? premises of sports",
        "you Could present on the facilities various list campus sports ? the",
        "kinds found of can within be What campus ? premises the sports facilities",
        "Enumerate the sports facilities available on the campus.",
        "are some campus in the facilities sport ? What",
        "available campus facilities sports the . Enumerate on the",
        "Could you list the various sports facilities present on the campus?",
        "sports the . the facilities campus available on Enumerate",
        "facilities sports available the . Enumerate the campus on",
        "kinds ? found premises within sports be facilities campus of the What can",
        "list sports Could ? present you various the the on campus facilities",
        "facilities What ? the are sport campus some in",
        "Could present campus the various on the facilities list ? sports you",
        "Enumerate the the campus available on . facilities sports",
        "you on the present sports the Could various ? campus list facilities",
        "What are some sport facilities in the campus?",
        "on sports ? list you the campus Could various the facilities present",
        "within What sports premises facilities kinds ? the be can of found campus",
        "What kinds of sports facilities can be found within the campus premises?"
      ],
      "responses": [
        "SJCE boasts an impressive range of sports facilities, catering to diverse interests and fitness levels. From outdoor options like the expansive Football ground and Cricket field to indoor spaces like the well-equipped Tennis court and Badminton courts, you'll find the perfect environment to stay active and fit!",
        "Within the campus, you'll find diverse sports facilities such as a tennis court, badminton, Kho-Kho, volleyball court, kabbadi, basketball court, football ground, gym, cricket field, table tennis, and handball field.",
        "On the campus, there are numerous sports facilities, including a tennis court, badminton, Kho-Kho, volleyball court, kabbadi, basketball court, football ground, gym, cricket field, table tennis, and handball field.",
        "Among the sports facilities on the campus are a tennis court, badminton, Kho-Kho, volleyball court, kabbadi, basketball court, football ground, gym, cricket field, table tennis, and handball field."
      ]
    },
    {
      "tag": "rubberInstitute",
      "patterns": [
        "Rubber Institute ) ? SJCE IRI Indian How is linked to (",
        "In what the capacity SJCE Indian associated ) Institute is ( Rubber IRI with ?",
        "is ? ( Institute capacity Rubber SJCE In what associated Indian with the IRI )",
        "( associated with In Rubber Institute is what SJCE the IRI ? capacity ) Indian",
        "? is to How Rubber IRI Institute ( ) linked SJCE Indian",
        "the between What SJCE Rubber ) ? is the Indian IRI connection and Institute (",
        "with How the Rubber Indian ( ? ) SJCE Institute IRI does collaborate",
        "How is to Indian ) Institute ( IRI Rubber linked ? SJCE",
        "Indian is ) IRI the SJCE with ( In capacity what Institute ? Rubber associated",
        "What is the connection between SJCE and the Indian Rubber Institute (IRI)?",
        "Indian is ) ? IRI Institute Rubber ( SJCE How linked to",
        "How is Indian Rubber Institute (IRI) linked to SJCE?",
        ") the with How ( SJCE does collaborate ? IRI Rubber Indian Institute",
        "( IRI and Institute ) ? the is What between Indian the Rubber SJCE connection",
        "( collaborate SJCE How with Institute does ? the Indian Rubber IRI )",
        "? IRI Institute does with ( SJCE ) Indian the Rubber How collaborate",
        "SJCE ? ( with IRI capacity Institute the is ) what Indian In associated Rubber",
        "connection Institute ) SJCE and is ? Rubber the IRI Indian the ( between What",
        "Institute ? SJCE ) between ( and is IRI the Indian What Rubber the connection",
        "connection IRI Institute ? Indian ( the What SJCE Rubber ) and the between is",
        "In what capacity is SJCE associated with the Indian Rubber Institute (IRI)?",
        "to ? ( linked SJCE Indian How IRI is Rubber ) Institute",
        "How does SJCE collaborate with the Indian Rubber Institute (IRI)?",
        "SJCE How ) ? does Indian ( the collaborate IRI Institute with Rubber"
      ],
      "responses": [
        "SJCE and IRI share a strong collaborative bond formalized through a Memorandum of Understanding (MoU). This partnership unlocks a wealth of benefits for SJCE students, including:<br/> - Exposure to cutting-edge research in sports material development, biomechanics, and training methodologies.<br/> - Joint research projects with IRI researchers.<br/> - Exclusive internship opportunities at IRI.<br/> - Guest lectures and workshops by renowned IRI experts.",
        "SJCE and IRI have entered into a Memorandum of Understanding (MoU).",
        "SJCE has established a partnership with IRI through a Memorandum of Understanding.",
        "SJCE and IRI are interconnected through a formal Memorandum of Understanding."
      ]
    },
    {
      "tag": "spiritualCentre",
      "patterns": [
        "purposes situated so a facility spiritual if it Does provide college the and , ? is , where for",
        "it Does provide and , purposes college ? for is situated a facility the if spiritual so , where",
        "provide any space the spiritual practices information within ? to you about college Could dedicated",
        "practices you to provide space dedicated about the within any ? information spiritual Could college",
        "? dedicated any provide practices information about spiritual college Could you to space the within",
        "provide where for and , facility situated college spiritual is Does , a so it the ? if purposes",
        "Is there a designated area for spiritual activities within the college premises?",
        "the in engage spiritual college activities Is place students a within can where ? there",
        "Could you provide information about any space within the college dedicated to spiritual practices?",
        ", the it , so college provide purposes facility is ? and a where situated for spiritual Does if",
        "spiritual Is a within the premises activities ? designated college area there for",
        "Is there a place within the college where students can engage in spiritual activities?",
        "about within ? to spiritual the space dedicated college information provide practices Could you any",
        "place ? within Is spiritual activities a in engage where there college can students the",
        "spiritual ? can engage students activities there within in Is place college where the a",
        "for college ? Is spiritual a within premises there activities area designated the",
        "Does the college provide a facility for spiritual purposes, and if so, where is it situated?",
        "there students Is can within place ? the college in spiritual activities engage where a",
        "within about provide Could practices space the information college any to dedicated ? you spiritual",
        "there the premises for within spiritual activities area Is a ? designated college",
        "area activities the for designated Is spiritual premises college within a there ?",
        "can there engage college the where place within in activities students Is a spiritual ?",
        "a ? within the there for designated spiritual premises activities college area Is",
        "the , situated so a is Does , college for spiritual where it facility provide and purposes if ?"
      ],
      "responses": [
        "Indeed, there is a well-established prayer hall located behind the Ganesha Temple, serving as a space for prayer and meditation for individuals of all religious beliefs.",
        "Certainly, there is a well-established prayer hall situated behind the Ganesha Temple, designed for prayer and meditation activities catering to individuals of all religious backgrounds.",
        "Yes, a fully-equipped prayer hall, located behind the Ganesha Temple, offers a dedicated space for prayer and meditation, welcoming individuals from all religious affiliations.",
        "Absolutely, there is a dedicated prayer hall situated behind the Ganesha Temple, providing a serene space for prayer and meditation that is open to individuals of all religious beliefs."
      ]
    },
    {
      "tag": "mathsCompulsory",
      "patterns": [
        "mathematics subject many is the included as semesters program In a academic in how ?",
        "Till which sem one needs to ztudy mathematics as a subject?",
        "ztudy sem as to needs a mathematics subject one Till ? which",
        "which include Up a the curriculum semester mathematics ? to subject as does mandatory",
        "mathematics subject as ? to sem a needs ztudy one which Till",
        "the which During a mathematics is required curriculum subject ? in semesters",
        "mathematics the semester which as ? mandatory include to curriculum Up does subject a",
        "mathematics in required is curriculum a which the subject During ? semesters",
        "ztudy one sem a ? as which mathematics subject needs to Till",
        "During which semesters is mathematics a required subject in the curriculum?",
        "mathematics subject how is ? included as a the semesters many in academic In program",
        "does Up semester to which mathematics subject ? as the mandatory a curriculum include",
        "is a how included subject the ? many In mathematics in semesters as academic program",
        "mathematics During which curriculum the ? required in a is semesters subject",
        "is how many ? in academic a the In semesters mathematics program included as subject",
        "the curriculum mathematics mandatory does to a Up include subject semester which as ?",
        "In how many semesters is mathematics included as a subject in the academic program?",
        "curriculum required the mathematics in subject is which During semesters ? a",
        "which to semester curriculum a include ? subject Up the mandatory mathematics does as",
        "sem ztudy needs as subject which a mathematics one Till to ?",
        "mathematics required in which subject During semesters is curriculum ? the a",
        "a is subject as the mathematics how ? program in semesters In included many academic",
        "Up to which semester does the curriculum include mathematics as a mandatory subject?",
        "a mathematics sem subject ? needs which Till ztudy as to one"
      ],
      "responses": [
        "Mathematics is a mandatory subject up to the fourth semester.",
        "Mathematics is part of the curriculum until the completion of the fourth semester.",
        "Mathematics is a compulsory subject up to the fourth semester.",
        "Mathematics needs to be studied till 4th semester."
      ]
    },
    {
      "tag": "csLocation",
      "patterns": [
        "can ) Engineering and ? found the Where branch ( the Computer on Science CSE campus be",
        "of CSE Engineering you ) Science Could Computer ( about branch the whereabouts the provide ? and information",
        "and location is the ? the CSE What of ) Computer Science ( specific branch Engineering",
        "you information branch provide the the ? Engineering ( CSE about and of Science Could Computer whereabouts )",
        "Where on the campus premises can one locate the Computer Science and Engineering (CSE) branch?",
        "the and on can campus premises ) one Where ? locate Computer ( Science CSE the branch Engineering",
        "Where can the Computer Science and Engineering (CSE) branch be found on the campus?",
        "Could you provide information about the whereabouts of the Computer Science and Engineering (CSE) branch?",
        "campus one and ) ? the ( Engineering premises Computer Science branch on Where CSE can the locate",
        "Computer What is the Science ? the and branch CSE ) ( specific location of Engineering",
        "the ( Engineering one locate Where campus Computer Science the can CSE ) branch on premises and ?",
        "the Science Computer CSE specific is What location ? of the branch ( ) and Engineering",
        "and locate ) CSE Computer Engineering one the branch Science premises campus ( on Where the can ?",
        "Science of ) Computer CSE Engineering ? location the ( and the branch specific is What",
        "the branch you information Science of about the Engineering ( whereabouts Computer and Could ? ) CSE provide",
        "the ? on CSE campus ( the ) be and branch Engineering Science found can Computer Where",
        "the can branch campus Computer the ) on ( ? found Where be and Engineering CSE Science",
        "the ( CSE Computer can and Engineering found Where ) the ? campus on be Science branch",
        "What is the specific location of the Computer Science and Engineering (CSE) branch?",
        "branch on locate campus ? and Engineering can ( premises Computer the one CSE Where Science the )",
        "( branch of about Could information the whereabouts Science provide ? and Engineering Computer you CSE ) the",
        "( the branch provide Engineering of ? Could whereabouts information CSE about Computer ) the you and Science",
        "Engineering location CSE specific and the is ( Computer ? What of branch the ) Science",
        "branch found the ) CSE and Science Where be Computer ( ? campus the Engineering can on"
      ],
      "responses": [
        "The Computer Science and Engineering (CSE) branch is located in Golden Jubilee Bhavan on the ground floor and the first floor.",
        "The Computer Science and Engineering (CSE) branch is situated in Golden Jubilee Bhavan, spanning the ground floor and the first floor.",
        "The Computer Science and Engineering (CSE) branch is positioned in Golden Jubilee Bhavan, covering both the ground floor and the first floor.",
        "The Computer Science and Engineering (CSE) branch is situated in Golden Jubilee Bhavan, occupying both the ground floor and the first floor."
      ]
    },
    {
      "tag": "cricketGround",
      "patterns": [
        "Where on the campus premises can one locate the cricket ground?",
        "you the provide cricket ground Could ? of the about whereabouts information",
        "ground on can Where one cricket locate campus premises the the ?",
        "the found the cricket campus ground on be ? can Where",
        "ground the be Where on found cricket ? campus can the",
        "What is the specific location of the cricket ground on the campus?",
        "ground campus can the ? cricket the Where on locate one premises",
        "the about provide information ground ? whereabouts you cricket Could the of",
        "Where can the cricket ground be found on the campus?",
        "cricket the ? on campus found Where be the can ground",
        "specific location is the ? of ground What on the campus the cricket",
        "Where ? found be can the on the cricket ground campus",
        "provide whereabouts cricket ? of you ground Could about the the information",
        "one the cricket Where can locate on the premises ? ground campus",
        "premises the the Where one campus can ? locate on cricket ground",
        "provide the cricket of ground ? about whereabouts you the Could information",
        "the the What on is cricket campus ? specific of location ground the",
        "the ground be cricket ? on the found campus can Where",
        "the Where can one locate premises on campus ? ground the cricket",
        "? provide the you whereabouts Could the about ground cricket of information",
        "of the ground is specific ? the the What cricket location campus on",
        "Could you provide information about the whereabouts of the cricket ground?",
        "What the cricket on is of campus ? the location ground specific the",
        "the the ground of What location is on the cricket campus ? specific"
      ],
      "responses": [
        "The cricket ground is situated near the Indian Rubber Institute at the KSCA cricket ground.",
        "The KSCA cricket ground is located near the Indian Rubber Institute.",
        "The cricket ground is positioned near the Indian Rubber Institute at the KSCA cricket ground.",
        "The KSCA cricket ground, used for cricket activities, is situated near the Indian Rubber Institute."
      ]
    },
    {
      "tag": "bankingFacilities",
      "patterns": [
        "? banking campus can Where within access services one the",
        "Can you provide information about the banking services on the campus?",
        "college are facilities the ? available within What banking campus",
        "? campus are What on options available college banking the",
        "provide banking you services on the information about Can ? the campus",
        "Where one campus banking services within can access the ?",
        "information services about you provide Can banking the the ? on campus",
        "What ? available options banking the on are campus college",
        "the services within Where one banking campus ? access can",
        "information ? you about campus on the provide services the banking Can",
        "one campus within the banking ? access services can Where",
        "within are ? college campus What facilities banking available the",
        "What banking facilities are available within the college campus?",
        "within banking What the available ? facilities college campus are",
        "college ? banking What are facilities the campus available within",
        "campus one services ? banking within Where the access can",
        "options ? on campus college are banking the What available",
        "the on college campus banking ? What options are available",
        "campus banking the facilities What are available ? college within",
        "Where can one access banking services within the campus?",
        "Can information you services the provide about ? the banking on campus",
        "the campus available What are options college banking ? on",
        "on the Can banking about the campus you information services provide ?",
        "What banking options are available on the college campus?"
      ],
      "responses": [
        "Andhra Bank operates a branch within the college campus, catering to the banking needs of both students and faculty members. Additionally, there are two Automatic Teller Machine (ATM) machines installed within the campus.",
        "The college campus features an Andhra Bank branch, offering banking services to students and faculty members. Furthermore, two Automatic Teller Machine (ATM) machines are available on the campus.",
        "A branch of Andhra Bank is present within the college campus, providing banking services for students and faculty members. Additionally, there are two Automatic Teller Machine (ATM) machines located on the premises.",
        "The college campus is equipped with an Andhra Bank branch to meet the banking needs of students and faculty. Moreover, there are two Automatic Teller Machine (ATM) machines installed within the campus."
      ]
    },
    {
      "tag": "yogaFacilities",
      "patterns": [
        "What are the yoga options for students and faculty within the college?",
        "facilities provide the Could you information on about campus yoga college ?",
        "the students within ? faculty are yoga the options and for college What",
        "facilities provide ? about yoga Could campus on college the you information",
        "the yoga facilities available in there ? Are college",
        "facilities ? Are available the in yoga college there",
        "are ? within students college options and What for the faculty yoga the",
        "on facilities college Could ? the you information yoga campus provide about",
        "at college a there provision ? Is yoga the for",
        "and college faculty within What yoga the options students are for ? the",
        "Are facilities college ? there yoga the available in",
        "faculty and for yoga within the the ? are options college What students",
        "the campus yoga provide ? on facilities about information Could college you",
        "? at there for the provision Is a college yoga",
        "at college provision the yoga ? for Is a there",
        "Are there yoga facilities available in the college?",
        "a Is ? the yoga at provision there for college",
        "there the Are yoga in ? college available facilities",
        "the college faculty within for the are students ? yoga and What options",
        "you on the Could about provide college information ? facilities yoga campus",
        "Could you provide information about yoga facilities on the college campus?",
        "the available facilities in yoga Are college there ?",
        "Is there a provision for yoga at the college?",
        "at there the ? yoga for a provision college Is"
      ],
      "responses": [
        "Yoga classes are conducted for both faculty and students at the Yoga Education Center in collaboration with Pathanjali Yoga Kendra. Two yoga instructors are present to guide the students and faculty members.",
        "Yes, there are yoga facilities on the college campus. Yoga classes are organized for faculty and students at the Yoga Education Center, in collaboration with Pathanjali Yoga Kendra. The classes are conducted under the guidance of two yoga instructors.",
        "Yes, the college provides yoga facilities. Yoga classes take place at the Yoga Education Center in collaboration with Pathanjali Yoga Kendra, with two dedicated yoga instructors guiding both faculty and students.",
        "Certainly, the college offers yoga facilities. Yoga classes are held at the Yoga Education Center in collaboration with Pathanjali Yoga Kendra, catering to both faculty and students. The classes are led by two experienced yoga instructors."
      ]
    },
    {
      "tag": "saahas",
      "patterns": [
        "in adventure sports students interested options What for available ? are",
        "Is there a club specifically for adventure activities at the college?",
        "? a club tell campus if Could 's to me on you dedicated adventure sports there",
        "'s me club on if you there a tell to campus Could ? dedicated sports adventure",
        "'s a club to you if sports there on me ? adventure campus Could dedicated tell",
        "Is there a specific club for students interested in adventure activities?",
        "for Is at ? adventure club the there specifically college a activities",
        "? in What are adventure interested options for sports available students",
        "at activities Is adventure a for ? specifically there the college club",
        "for the a specifically there club ? Is at college activities adventure",
        "there specific ? for club adventure activities in a students Is interested",
        "specific club activities ? students for a in interested there Is adventure",
        "club ? the a adventure college Is specifically at activities for there",
        "at there club Is activities the for specifically college a adventure ?",
        "What options are available for students interested in adventure sports?",
        "there 's club you tell me a if campus adventure to dedicated Could ? on sports",
        "for in a there specific ? club students interested Is activities adventure",
        "options adventure students ? sports What in for available are interested",
        "Could you tell me if there's a club dedicated to adventure sports on campus?",
        "for interested ? adventure a there in Is club specific students activities",
        "students options are interested for adventure ? available What sports in",
        "there club you to sports if ? dedicated 's on a me Could adventure tell campus",
        "interested in students for are options available ? What sports adventure",
        "there ? students Is for adventure specific club a interested activities in"
      ],
      "responses": [
        "Yes, there is an adventure club called SAHAS. This club was initiated to provide the youth of SJCE with opportunities to participate in and enjoy adventure sports. SAHAS encourages students to push their boundaries and embrace challenges. The club's mission is not only to build strong individuals but also to raise awareness about nature and its importance and beauty.",
        "Certainly, there is an adventure club named SAHAS at the college. This club was established to enable SJCE's youth to partake in and relish adventure sports. SAHAS strives to motivate students to step out of their comfort zones and embrace challenges, fostering not only strength but also an appreciation for the beauty and significance of nature.",
        "Yes, there is an adventure club known as SAHAS. The club was created to offer the youth of SJCE the chance to engage in and enjoy various adventure sports. SAHAS is committed to inspiring students to face challenges beyond their comfort zones and, in the process, build resilience. Additionally, the club seeks to enhance students' awareness of the importance and beauty of nature.",
        "SJCE has an adventure club called SAHAS, designed for students who enjoy adventure sports. The club's purpose is to encourage youth to participate in challenging activities that go beyond their comfort zones. SAHAS not only focuses on building individual strength but also on promoting awareness of nature's importance and beauty among students."
      ]
    },
    {
      "tag": "techClubs",
      "patterns": [
        "technical Which the college ? in clubs present are",
        "clubs technical college present in the are Which ?",
        "college you Could provide ? about information clubs the within technical the",
        "of college ? list technical some the Can clubs in available you the",
        "the ? the of college technical list clubs you in Can some available",
        "What are the names of the technical clubs in the college?",
        "clubs ? college in Which the present technical are",
        "Could you provide information about the technical clubs within the college?",
        "within provide clubs the ? you Could college the information technical about",
        "provide clubs information Could ? college the within technical you about the",
        "technical the ? Which are in present clubs college",
        "in the available college some you the technical Can list clubs of ?",
        "the some list technical college Can clubs ? of available you in the",
        "the What of the the technical are college clubs in ? names",
        "Which technical clubs are present in the college?",
        "names technical What of the the ? in the clubs college are",
        "the Which present technical are in ? college clubs",
        "within the you provide college information about technical clubs Could the ?",
        "college the the technical in names What the ? are clubs of",
        "technical within the the ? information clubs you college Could provide about",
        "What of clubs the in the are ? college names the technical",
        "? the of the are clubs technical college the names in What",
        "the list college ? the of in clubs you some technical available Can",
        "Can you list some of the technical clubs available in the college?"
      ],
      "responses": [
        "The college hosts several technical clubs, including IEEE - SJCE Student Chapter, Linux Campus Club, CSI-SJCE Student Chapter, Sparsh Talks, TESLA, and the Mechanical Engineers' Association.",
        "Among the technical clubs in the college are IEEE - SJCE Student Chapter, Linux Campus Club, CSI-SJCE Student Chapter, Sparsh Talks, TESLA, and the Mechanical Engineers' Association.",
        "Technical clubs in the college include IEEE - SJCE Student Chapter, Linux Campus Club, CSI-SJCE Student Chapter, Sparsh Talks, TESLA, and the Mechanical Engineers' Association.",
        "Several technical clubs are active in the college, such as IEEE - SJCE Student Chapter, Linux Campus Club, CSI-SJCE Student Chapter, Sparsh Talks, TESLA, and the Mechanical Engineers' Association."
      ]
    },
    {
      "tag": "edBoard",
      "patterns": [
        "the club you the of Can literary college ? name",
        "What is the literature club of the college?",
        "Can you name the literary club of the college?",
        "college is club the of ? What literature the",
        "Which organization is responsible for literary activities in the college?",
        "the college organization ? in Which responsible for literary is activities",
        "the ? name you club of the Can literary college",
        "literary you Can name college the ? club the of",
        "activities organization college for responsible the in ? Which literary is",
        "literary the organization ? in responsible activities for is college Which",
        "of is on What campus charge events in organization ? literary",
        "club literature of ? the is What the college",
        "Can college of you club name the ? literary the",
        "is responsible organization in activities ? the for literary college Which",
        "What organization is in charge of literary events on campus?",
        "events charge literary campus ? organization of What in on is",
        "? for organization activities responsible the is in literary Which college",
        "is of college the ? the literature What club",
        "of What college the literature ? the club is",
        "of the you club college Can name literary the ?",
        "organization literary What in events charge of is on campus ?",
        "the college club What ? of is literature the",
        "in organization events ? is campus on literary of charge What",
        "campus literary in charge on is ? organization events of What"
      ],
      "responses": [
        "The Editorial Board serves as the literature club of the college. They are responsible for producing the annual college magazine Jayzine and organizing the annual literary fest || shabd ||. The Board comprises members from various departments, selected through a rigorous and unique recruitment process. Additionally, they conduct various debates and discussions on campus.",
        "The Editorial Board functions as the literature club of the college. Their duties include publishing the annual college magazine Jayzine, hosting the annual literary fest || shabd ||, and organizing debates and discussions on campus. Members are selected from different departments through a rigorous recruitment process.",
        "The Editorial Board serves as the literary club of the college, overseeing the creation of the annual college magazine Jayzine and organizing the annual literary fest || shabd ||. The recruitment process for board members is rigorous and unique, and they also conduct debates and discussions on campus.",
        "The college's literature club is known as The Editorial Board. They are responsible for producing the annual college magazine Jayzine, coordinating the annual literary fest || shabd ||, and organizing debates and discussions on campus. Board members are selected from various departments through a rigorous recruitment process."
      ]
    },
    {
      "tag": "boysWarden",
      "patterns": [
        "? hostel at of the position holds ' the Who Warden Chief boys",
        "' position hostel holds ? the Chief the Who at Warden of boys",
        "about the boys you of ? Chief current Warden hostel share Could the ' details",
        "hostel about ' the Can boys information of the provide Warden you Chief ?",
        "? of about details hostel the current Chief the you Could ' share Warden boys",
        "Who the Warden ? Chief the ' holds at boys position hostel of",
        "hostel share Could of boys the Warden ? you Chief ' the details current about",
        "Who holds the position of Chief Warden at the boys' hostel?",
        "Could you share details about the current Chief Warden of the boys' hostel?",
        "is of the ' Warden for the Chief ? at hostel boys responsible Who role currently",
        "role Warden ? boys for of Chief at currently responsible the hostel ' the is Who",
        "you provide Can ' ? Warden the boys hostel of Chief information about the",
        "current the the Could Warden ' ? hostel share details of about Chief you boys",
        "boys holds of Warden at hostel the ' Chief position the Who ?",
        "Warden the boys currently ' for responsible Who ? the Chief hostel at role is of",
        "hostel of the Chief Can about you the information ? boys Warden ' provide",
        "Can you provide information about the Chief Warden of the boys' hostel?",
        "' position at Warden of Chief ? hostel the boys Who holds the",
        "the you Can ? hostel information provide the of Warden ' boys about Chief",
        "boys responsible Who the for at currently hostel Warden ' of is role ? Chief the",
        "you Can hostel boys about provide Chief Warden the ? ' information of the",
        "the at the role responsible Who for is currently ' hostel boys Warden ? Chief of",
        "Who is currently responsible for the role of Chief Warden at the boys' hostel?",
        "' of Chief the the about Could hostel Warden boys current ? share you details"
      ],
      "responses": [
        "Dr. P. Mallu serves as the Chief Warden of SJCE boys' hostel.",
        "Dr. P. Mallu holds the position of Chief Warden at SJCE boys' hostel.",
        "The Chief Warden of SJCE boys' hostel is Dr. P. Mallu.",
        "Dr. P. Mallu is the Chief Warden of SJCE boys' hostel."
      ]
    },
    {
      "tag": "girlsWarden",
      "patterns": [
        "' you SJCE the at of Girls Chief the ? Hostel identify Warden Can",
        "Could you provide the name of the Chief Warden for the Girls' Hostel at SJCE?",
        "currently the Who the Chief Hostel Girls position at Warden of ? holds '",
        "Chief you Girls provide Could at for the name the ? of Hostel the SJCE Warden '",
        "Can you identify the Chief Warden of the Girls' Hostel at SJCE?",
        "? Chief name Hostel at provide Warden you Could the the of Girls ' for the SJCE",
        "? the Warden of Hostel you Can ' identify the SJCE Chief at Girls",
        "is Girls Warden the the Chief of ? ' as charge Who in Hostel",
        "of the Hostel as Warden Who charge Girls the ' ? in is Chief",
        "the ? ' Girls Who of charge is the as Hostel in Warden Chief",
        "Warden Hostel ? of ' identify the Chief the you SJCE Can Girls at",
        "name SJCE for you at Girls ? provide Warden the Chief the ' of Could Hostel the",
        "Chief Warden is of ? Girls in charge the Hostel ' as the Who",
        "for Girls provide ? the Chief Could ' name of Warden you the at the SJCE Hostel",
        "? currently of the holds position Warden Chief Girls the Hostel Who at '",
        "' at of currently position Who ? Chief Hostel Warden the Girls the holds",
        "Hostel Girls SJCE Chief ? Can Warden at the you ' the identify of",
        "holds Hostel at position Warden Chief ? the the of ' currently Girls Who",
        "Who currently holds the position of Chief Warden at the Girls' Hostel?",
        "Who is in charge as the Chief Warden of the Girls' Hostel?",
        "the the holds of position at Chief currently ' Hostel ? Who Girls Warden",
        "of Chief Hostel SJCE Could you Warden Girls the provide ' ? at the the for name",
        "Hostel the as Who Chief Girls Warden ? of the charge is in '",
        "of you the ? Chief ' the Girls Hostel Can identify SJCE Warden at"
      ],
      "responses": [
        "Ms. Ambika H S  is the Chief Warden of the SJCE Girls' Hostel.",
        "The Chief Warden of the SJCE Girls' Hostel is Ms. Ambika H S .",
        "Ms. Ambika H S serves as the Chief Warden of the SJCE Girls' Hostel.",
        "Ms. Ambika H S  is currently holding the position of Chief Warden at the SJCE Girls' Hostel."
      ]
    },
    {
      "tag": "placementOfficer",
      "patterns": [
        "In the role of placement officer, who is responsible for placements at the campus?",
        "you the the provide of ? Can officer information about campus placement",
        "? In campus placements of at is placement for responsible the who role , the officer",
        "placement information Can the provide about officer the campus of ? you",
        "individual of placement ? campus the is the serving currently as officer the Who",
        "at the of campus officer ? placement Who the holds position the",
        "Who holds the position of the placement officer at the campus?",
        "the Who at ? the holds position of the placement officer campus",
        "the campus of role the who for ? , placements placement is at officer In responsible",
        "? responsible the officer role placements for who campus is In of , at the placement",
        "? of campus officer holds placement the the position the Who at",
        "individual currently the is officer serving of the placement ? campus Who as the",
        "Who the ? at holds the position the placement campus officer of",
        "is as serving currently ? campus the the the officer individual placement Who of",
        "Can the you information provide of the campus officer about placement ?",
        "Who is the individual currently serving as the placement officer of the campus?",
        "is responsible In role placements ? , placement of who the for the at campus officer",
        "Who the campus placement the serving of as officer ? individual the currently is",
        "Can you provide information about the placement officer of the campus?",
        "the provide officer about of ? information Can campus you placement the",
        "is ? officer of campus the the the currently placement Who serving individual as",
        "Who holds ? officer campus of the the placement the at position",
        "information Can about provide of the placement campus ? the you officer",
        "the ? the placements role is campus for In of placement , who officer responsible at"
      ],
      "responses": [
        "Dr. Pradeep M serves as the placement officer at SJCE/JSS.",
        "The placement officer at SJCE/JSS is Dr. Pradeep M.",
        "Dr. Pradeep M is the designated placement officer responsible for placements at SJCE/JSS.",
        "The current placement officer at SJCE/JSS is Dr. Pradeep M."
      ]
    },
    {
      "tag": "libraryEstablished",
      "patterns": [
        "Centre of Can Library about information year founding ? the share Information and the you",
        "? Centre Information provide the Could year of the establishment Library you and",
        "In what Information the established Centre year ? was and Library",
        "Can and year Information the information founding Centre ? you about share the Library of",
        "the ? was In year Library and Information what Centre established",
        "Information establishment and Could of year ? you provide Centre the Library the",
        "? the the and of establishment year Information Centre provide you Could Library",
        "share Can you the Library the Information ? information founding of Centre and about year",
        "provide ? of Library year Information you and Centre Could establishment the the",
        "and In the was Information Library what year Centre ? established",
        "In what year was the Library and Information Centre established?",
        "Could you provide the establishment year of the Library and Information Centre?",
        "on the library first campus established was ? the When",
        "? first established When on was campus library the the",
        "? on the library first the When established campus was",
        "Can you share information about the founding year of the Library and Information Centre?",
        "share the about Can year you founding the Information information ? of Centre and Library",
        "the ? Information year the provide Centre of establishment and Library Could you",
        "and share founding Can the Information Library the about information of you ? year Centre",
        "campus the on the was established library ? first When",
        "what In year and the Library established Information ? Centre was",
        "the When library was established campus the first ? on",
        "When was the library on the campus first established?",
        "Centre established In Library ? Information what year was the and"
      ],
      "responses": [
        "The Library and Information Centre was set up in the year 1963.",
        "The Library and Information Centre was founded in the year 1963.",
        "The Library and Information Centre at the campus was established in the year 1963.",
        "The Library and Information Centre was established on the campus in the year 1963."
      ]
    },
    {
      "tag": "librarian",
      "patterns": [
        "the librarian campus designated currently Who as the ? at is",
        "Who the librarian campus ? as is currently at designated the",
        "Can you provide information about the librarian of the Library and Information Centre?",
        "information Can of you about librarian and ? the Centre Library Information the provide",
        "and Who Centre of ? currently librarian the as individual the Library is the Information serving",
        "Who of and the librarian ? is the Library Centre Information",
        "Library ? the Information and is serving the currently as the Who individual Centre librarian of",
        "the Centre Information the of Can you and about Library provide librarian information ?",
        "Who the currently as designated is librarian campus the ? at",
        "librarian Centre the and Library the Information Who is ? of",
        "Who is currently designated as the librarian at the campus?",
        "and the librarian Centre the of Information ? Library is Who",
        "campus of What the the librarian is ? overseeing name the",
        "the the librarian provide ? campus Can name current at the of you",
        "the the ? the is What overseeing name of campus librarian",
        "Who is the librarian of the Library and Information Centre?",
        "of name current you the librarian campus the at Can provide the ?",
        "of campus provide you the name at the the current Can librarian ?",
        "of name the overseeing What ? the librarian campus is the",
        "librarian Centre Who ? Library is the the and Information of",
        "librarian as is at designated currently the campus ? the Who",
        "? is Library librarian Who the of Centre the and Information",
        "holds the librarian position the ? campus Who of the at",
        "the position librarian holds at of campus the ? Who the",
        "the Centre Information the librarian and Library ? is of Who",
        "Can you provide the name of the current librarian at the campus?",
        "Library Centre Information Can the information the librarian and ? provide about of you",
        "? Information Centre of Who the the and serving librarian as the Library currently individual is",
        "name provide librarian of at campus the current the the you Can ?",
        "librarian at the ? campus Who the holds of position the",
        "the ? of overseeing campus the is name What librarian the",
        "is librarian the as currently Centre individual of serving Who the Information and Library ? the",
        "Library of the is Who ? Information librarian Centre the and",
        "Who holds the position of the librarian at the campus?",
        "Who of holds the ? the the at campus librarian position",
        "is the ? name of the What campus the overseeing librarian",
        "Who Centre of the Library and is ? the librarian Information",
        "What is the name of the librarian overseeing the campus?",
        "and Centre Can Information the the of librarian information about provide you Library ?",
        "of ? librarian position the Who campus the the holds at",
        "Information is Library Centre the and Who of librarian the ?",
        "the ? at campus the librarian Who as designated currently is",
        "librarian is Library the ? the Who Centre of Information and",
        "of Information provide the you ? the about and librarian Can Centre information Library",
        "the librarian the of current you at Can ? the provide campus name",
        "Who is the individual currently serving as the librarian of the Library and Information Centre?",
        "and the Library Centre the librarian currently ? of individual Information is the Who serving as"
      ],
      "responses": [
        "Basappa, K.L. serves as the librarian at SJCE/JSS.",
        "The current librarian at SJCE/JSS is Basappa, K.L.",
        "Basappa, K.L. currently holds the position of librarian at SJCE/JSS.",
        "The librarian for SJCE/JSS is Basappa, K.L."
      ]
    },
    {
      "tag": "mechHOD",
      "patterns": [
        "department the head the Mechanical you the serving as of individual identify Can ?",
        "Who currently holds the position of the Head of the Mechanical Department?",
        "Who the is of HOD department mechanical",
        "who is the hod of mechanical in jssstu ",
        "Name the head of department in mechanical branch",
        "Mechanical Department holds ? Head the the the currently of position of Who",
        "Mechanical occupying ? the is name the the currently head the of What of role person department",
        "the as serving Mechanical you the Can department the individual identify ? of head",
        "is the the of name role head ? What the Mechanical department the currently occupying of person",
        "What name is hod the mechanical of the",
        "person What occupying currently is the name the role the department head of of Mechanical the ?",
        "the department mechanical of Name head in branch",
        "the information the Department provide of Mechanical about Head Could you ? current",
        "department mechanical branch the in Name of head",
        "the of currently position the Mechanical Head Who ? holds the of Department",
        "who mechanical department in head the is of jssstu of",
        "department in Name the mechanical head branch of",
        "of the the is mechanical name What hod",
        "of the is hod who mechanical jssstu in",
        "name What is mechanical of hod the the",
        "the the Head Department of the currently ? of Mechanical position holds Who",
        "? Could Head about provide the information current Mechanical of Department you the",
        "of mechanical department is HOD Who the",
        "the of is hod mechanical the What name",
        "serving the you Mechanical department Can ? the individual of identify head as the",
        "Could about Head provide you current the Mechanical Department information the ? of",
        "Who is the HOD of mechanical department",
        "is mechanical who jssstu in the hod of",
        "is mechanical jssstu of hod in the who",
        "position of Who currently Head ? the the of the Department holds Mechanical",
        "currently the of head the role is of department the occupying name the Mechanical ? person What",
        "What is the name of the mechanical hod",
        "branch department head the in Name mechanical of",
        "information current Head about of Mechanical Department Could you provide the the ?",
        "Can you identify the individual serving as the head of the Mechanical department?",
        "jssstu mechanical of the who hod in is",
        "holds Who the Department of Head of Mechanical position the currently the ?",
        "the HOD mechanical department of is Who",
        "who is the head of department of mechanical in jssstu",
        "of is the mechanical the What name hod",
        "who head of department is in mechanical the of jssstu",
        "Could you provide information about the current Head of the Mechanical Department?",
        "of Mechanical the as the serving department Can head the ? identify you individual",
        "What is the name of the person currently occupying the role of the Mechanical department head?",
        "department mechanical is of HOD Who the",
        "of department who mechanical in the jssstu of head is",
        "head you ? the individual of Mechanical serving identify as department Can the the",
        "name ? Mechanical department occupying of the role currently the is of person the head the What",
        "Department the provide information Mechanical Could ? Head the you about current of",
        "who mechanical the jssstu of hod in is",
        "mechanical department is of the Who HOD",
        "jssstu of department of in mechanical is head who the",
        "branch mechanical head the in of Name department",
        "department is in head of mechanical who of the jssstu"
      ],
      "responses": [
        "Dr. R Ravishankar is the Head of the Mechanical Department.",
        "The Head of the Mechanical Department is Dr. R Ravishankar.",
        "Dr. R Ravishankar holds the position of the Head of the Mechanical Department.",
        "The Head of the Mechanical Department is Dr. R Ravishankar."
      ]
    },
    {
      "tag": "civilHOD",
      "patterns": [
        "What is the name of the person currently occupying the role of the Civil department head?",
        "Civil ? currently the Department Who the position holds of Head the of",
        "department civil Who HOD is of the",
        "Could current information Civil ? about the Head you of provide the Department",
        "What is the name of the civil hod",
        "the serving ? identify of the individual department head as Can Civil you the",
        "of civil name the What the is hod",
        "of the hod who civil jssstu in is",
        "Department you the current about of Head Could provide Civil ? the information",
        "of currently Head the Civil ? the Department holds of Who position the",
        "head serving identify Can the ? department you individual the as Civil of the",
        "jssstu is hod in of who civil the",
        "department currently head is name occupying the Civil the ? person What role the of the of",
        "Can of Civil department the the individual identify the ? as serving you head",
        "head department Name of branch in the civil",
        "department of serving Can ? Civil as individual the the head the identify you",
        "the What the occupying department role head name ? the is of Civil person of currently the",
        "the who civil is in department of head jssstu of",
        "of Head Civil the the holds position Who Department of ? the currently",
        "hod jssstu civil the in of who is",
        "the the the Civil holds ? Who Head of Department of position currently",
        "the the the is head person Civil of name department occupying ? of What currently the role",
        "Could you provide information about the current Head of the Civil Department?",
        "who is the head of department of civil in jssstu",
        "Civil Could current Department of information ? Head the about the you provide",
        "jssstu in of department is the who civil head of",
        "is in the of jssstu of department civil head who",
        "Can you identify the individual serving as the head of the Civil department?",
        "civil department HOD of is Who the",
        "as of you head Civil ? the individual serving Can the the identify department",
        "HOD department civil of the is Who",
        "Name in department civil branch of the head",
        "Name of head in the branch civil department",
        "who is the hod of civil in jssstu ",
        "head branch civil the department of Name in",
        "department of branch civil Name head the in",
        "the Head Could ? you about current of Department the information provide Civil",
        "Name the head of department in civil branch",
        "is the hod the What civil of name",
        "Department Civil Head position the currently of of holds Who the ? the",
        "jssstu the hod is civil of in who",
        "of is hod civil What the the name",
        "Who currently holds the position of the Head of the Civil Department?",
        "civil of is jssstu in the hod who",
        "is civil department of in jssstu the who of head",
        "the of the hod What name civil is",
        "of occupying the head is Civil the of currently ? name role the person What department the",
        "is What name civil hod of the the",
        "of who is head department the of jssstu in civil",
        "the name currently What person head department role Civil occupying the of the the of ? is",
        "Who is the HOD of civil department",
        "is civil department HOD Who of the",
        "Department information ? Could Head Civil about current of the the you provide",
        "civil is department HOD of Who the"
      ],
      "responses": [
        "Dr. Nagabhushan is the Head of the Civil department.",
        "Dr. Nagabhushan serves as the Head of the Civil department.",
        "The Head of the Civil department is Dr. Nagabhushan.",
        "Dr. Nagabhushan is currently the Head of the Civil department."
      ]
    },
    {
      "tag": "envHOD",
      "patterns": [
        "hod the What the name of is environmental",
        "who in environmental of the hod is jssstu",
        "HOD of environmental the department is Who",
        "occupying department of of the head the the name role What currently the ? is Environmental person",
        "hod is who of in environmental jssstu the",
        "who is the hod of environmental in jssstu ",
        "who jssstu is environmental the of hod in",
        "identify Can head department ? the individual you serving as the Environmental of the",
        "the the about of you ? Environmental information Could Department current Head provide",
        "the of the What name is environmental hod",
        "the Environmental of provide current the Could Department ? you Head information about",
        "Who the is HOD department of environmental",
        "the Who ? the of position Head currently holds of Environmental the Department",
        "the in jssstu who environmental is of hod",
        "Environmental is the ? occupying What of currently the name department head person the of the role",
        "Who ? Environmental Department Head the currently the the of holds position of",
        "in Name department the of environmental head branch",
        "Who is the HOD of environmental department",
        "What is the name of the environmental hod",
        "Who department HOD of environmental the is",
        "Can you identify the individual serving as the head of the Environmental department?",
        "What is the name of the person currently occupying the role of the Environmental department head?",
        "What currently Environmental is the role department occupying the person name head of the of the ?",
        "in head department the Name of environmental branch",
        "provide the information Head Department of the Could about ? you current Environmental",
        "of is the What hod name environmental the",
        "Environmental Department Head of ? Who the position the the of currently holds",
        "Name the head of department in environmental branch",
        "of hod environmental is jssstu who the in",
        "of Environmental Can the department identify the you head serving the individual ? as",
        "Environmental person ? is occupying of the currently the of name the What head role the department",
        "who jssstu environmental is the in department of of head",
        "who of the department in head environmental is of jssstu",
        "the ? the information Head you Department about Could current of provide Environmental",
        "head the department of in jssstu environmental is of who",
        "What Environmental department person is head the of the ? the the currently occupying of name role",
        "who is the head of department of environmental in jssstu",
        "in the branch of head Name environmental department",
        "jssstu of in department of who the environmental head is",
        "of Head of the the ? holds position Environmental the Who Department currently",
        "you department Environmental identify of as Can the serving the individual the head ?",
        "of environmental department of head is who the jssstu in",
        "Could you provide information about the current Head of the Environmental Department?",
        "of HOD department environmental Who is the",
        "as of head department you individual the the ? the serving Environmental identify Can",
        "department the Name of head in environmental branch",
        "currently ? holds Environmental the the position Who of Head Department the of",
        "department of Who the is environmental HOD",
        "Name environmental in head the department branch of",
        "head the the department Can as serving individual Environmental the you identify ? of",
        "Who currently holds the position of the Head of the Environmental Department?",
        "the the of Environmental Could Head ? information provide current Department you about",
        "the hod of environmental is What the name",
        "What name environmental the hod of the is"
      ],
      "responses": [
        "Dr. SADASHIVA MURTHY BM serves as the Head of the Department (HOD) for the Environmental department.",
        "The Head of the Environmental department is Dr. SADASHIVA MURTHY BM.",
        "The Head of the Department (HOD) for the Environmental department is Dr. SADASHIVA MURTHY BM.",
        "Dr. SADASHIVA MURTHY BM currently holds the position of Head of the Department (HOD) for the Environmental department."
      ]
    },
    {
      "tag": "mcaHOD",
      "patterns": [
        "is hod the jssstu in MCA of who",
        "person name of head is the MCA ? department occupying the of the currently the What role",
        "of ? What is of occupying MCA person the currently the the department head the name role",
        "serving Can ? the the of the department you as MCA identify head individual",
        "is of the person of role head department currently the MCA the the What occupying ? name",
        "person the currently of role head department name of the ? is MCA the What the occupying",
        "current information MCA the the Could about ? of you Department Head provide",
        "provide the MCA Could Head of current Department ? about the you information",
        "department the MCA head in of Name branch",
        "department Name in branch the of MCA head",
        "holds Who position of the Head ? the Department the MCA of currently",
        "MCA jssstu of who the is hod in",
        "MCA is What hod the the name of",
        "of department is who in MCA of the head jssstu",
        "the MCA Who HOD of department is",
        "Can MCA identify serving the you the of head department ? as individual the",
        "branch head Name in MCA department the of",
        "occupying name person What MCA of head currently the role is ? of the the the department",
        "of hod is the jssstu MCA who in",
        "of jssstu department head is who MCA the in of",
        "name of hod What the the is MCA",
        "the current you the provide ? about Head information MCA of Department Could",
        "Who is the HOD of MCA department",
        "MCA the Can the serving individual of head you the department identify ? as",
        "Could you provide information about the current Head of the MCA Department?",
        "holds Head position MCA ? the currently of the of Department the Who",
        "hod of MCA jssstu who is in the",
        "is MCA of HOD the department Who",
        "MCA the What name hod of is the",
        "of who in of head department is MCA the jssstu",
        "in MCA head of Name the branch department",
        "Name the head of department in MCA branch",
        "What is the name of the person currently occupying the role of the MCA department head?",
        "Who currently holds the position of the Head of the MCA Department?",
        "of the MCA is HOD department Who",
        "the currently position of Who MCA Head ? Department the of the holds",
        "Who MCA HOD the is department of",
        "who is the hod of MCA in jssstu ",
        "Can you identify the individual serving as the head of the MCA department?",
        "Who position the Department of Head holds the currently the ? MCA of",
        "Can ? of identify department individual the the head MCA serving you as the",
        "who is the head of department of MCA in jssstu",
        "What is the name of the MCA hod",
        "the as of identify individual serving the Can the ? MCA department head you",
        "Head MCA the of current about you Department provide information the ? Could",
        "name the is MCA What of the hod",
        "Name the head in MCA department of branch",
        "the the What is MCA of name hod",
        "of head jssstu who is in of the department MCA",
        "? MCA Head provide information you Could the current of the about Department",
        "department HOD Who of MCA is the",
        "of of head in MCA jssstu the department who is",
        "the of hod MCA jssstu in who is",
        "Department currently of the of position the holds Who the ? Head MCA"
      ],
      "responses": [
        "Dr. Bharathi R K is the Head of the Department (HOD) for the MCA department.",
        "The HOD of the MCA department is Dr. Bharathi R K.",
        "Dr. Bharathi R K holds the position of Head of the Department (HOD) for the MCA department.",
        "The current HOD of the MCA department is Dr. Bharathi R K."
      ]
    },
    {
      "tag": "csbsHOD",
      "patterns": [
        "is the name hod CSBS the What of",
        "What is the name of the CSBS hod",
        "department the HOD Who CSBS is of",
        "who is in CSBS of head department jssstu the of",
        "? the you serving the identify Can CSBS of the head individual as department",
        "the name is CSBS of hod the What",
        "position the Who currently ? of the Department Head of the holds CSBS",
        "of head branch the in CSBS department Name",
        "who is the head of department of CSBS in jssstu",
        "the is name CSBS the of What hod",
        "of the jssstu hod CSBS in is who",
        "the of is Who department HOD CSBS",
        "? is role the the CSBS of the the head of What name person department occupying currently",
        "Who is the HOD of CSBS department",
        "currently of holds Department ? of position the Who the the CSBS Head",
        "in jssstu who hod CSBS of is the",
        "What name is hod CSBS the of the",
        "jssstu CSBS of head department who of in the is",
        "Head position the holds Department the Who currently CSBS of ? of the",
        "? Could CSBS information Department about provide you of current Head the the",
        "hod of CSBS is the who in jssstu",
        "jssstu CSBS hod in is who the of",
        "about provide of Department Could information CSBS current Head the ? the you",
        "? currently CSBS Head the the the of position of Department holds Who",
        "of the of department in jssstu who is CSBS head",
        "the serving of CSBS identify Can individual ? the department head you the as",
        "Name the head of department in CSBS branch",
        "of department CSBS head Name in the branch",
        "Who currently holds the position of the Head of the CSBS Department?",
        "serving the department the CSBS of the Can as head individual ? you identify",
        "the Could current Department CSBS provide about you ? Head the information of",
        "who jssstu is in hod the CSBS of",
        "occupying of the the ? name the currently the person is department of What head role CSBS",
        "occupying the the CSBS the role head the name is of of ? What person currently department",
        "of ? department identify individual the head the as the you CSBS serving Can",
        "of in the department CSBS branch Name head",
        "department of of head who the in CSBS is jssstu",
        "is the currently ? role of department occupying the head the CSBS name the person What of",
        "of head of the in is jssstu department CSBS who",
        "the Can of ? you individual head CSBS the department serving identify as the",
        "is CSBS of Who HOD department the",
        "CSBS HOD is department of the Who",
        "branch in head department the CSBS Name of",
        "information Department of CSBS you ? about Could the current the provide Head",
        "Who holds CSBS currently the Department Head ? the the of position of",
        "Could you provide information about the current Head of the CSBS Department?",
        "department is of HOD Who the CSBS",
        "department of the head CSBS in branch Name",
        "CSBS current ? Could Department you the about Head the provide of information",
        "Can you identify the individual serving as the head of the CSBS department?",
        "who is the hod of CSBS in jssstu ",
        "What is the name of the person currently occupying the role of the CSBS department head?",
        "What currently the head the the CSBS the occupying is person role department name of ? of",
        "the name CSBS What of is the hod"
      ],
      "responses": [
        "Dr. B S Mahanand holds the position of Head of the Department (HOD) for the CSBS department.",
        "The current Head of the Department (HOD) for the CSBS department is Dr. B S Mahanand, who also oversees the CSBS department.",
        "Dr. B S Mahanand is the designated Head of the Department (HOD) for the CSBS department, also overseeing the CSBS department.",
        "The HOD for the CSBS department is Dr. B S Mahanand, who concurrently serves as the HOD for the CSBS department."
      ]
    },
    {
      "tag": "chemistryHOD",
      "patterns": [
        "Who currently holds the position of the Head of the Chemistry Department?",
        "hod in chemistry is of jssstu who the",
        "the is jssstu chemistry of hod who in",
        "Chemistry ? of serving identify the Can individual as you department the head the",
        "branch head in the Name of chemistry department",
        "department the who of is of in head jssstu chemistry",
        "the identify the Can head as individual Chemistry department the you of ? serving",
        "of is chemistry in jssstu who hod the",
        "chemistry of the is HOD department Who",
        "you the the Chemistry serving the of head Can identify ? individual as department",
        "of current about you Chemistry Head Could information the the Department ? provide",
        "Name the head of department in chemistry branch",
        "Chemistry of is of occupying name the role the currently the the person ? What head department",
        "the Department you of Chemistry Head the about current ? provide information Could",
        "? the the the person Chemistry head occupying What of of is department name currently role the",
        "of is the What name chemistry the hod",
        "Name in head branch department of chemistry the",
        "Name head department chemistry in branch the of",
        "What is the name of the chemistry hod",
        "of is What name hod the chemistry the",
        "chemistry head jssstu department the is in of who of",
        "Can you identify the individual serving as the head of the Chemistry department?",
        "individual the you department the Can as serving identify Chemistry head ? of the",
        "role occupying ? of Chemistry person department is What the head of name the currently the the",
        "is of hod chemistry the What name the",
        "is head who department the of chemistry jssstu of in",
        "person is of of currently name Chemistry the role head the the the department ? occupying What",
        "Head of position ? currently Department holds of the Chemistry the Who the",
        "provide the Chemistry ? Could Head information you Department of about current the",
        "Who is the HOD of chemistry department",
        "Who is department the chemistry HOD of",
        "the chemistry hod name is What of the",
        "What is the name of the person currently occupying the role of the Chemistry department head?",
        "of provide Head the the ? you current information about Department Could Chemistry",
        "chemistry in the is of of department head who jssstu",
        "Could Department the of current ? Chemistry the provide information about Head you",
        "the currently of Chemistry the Department position Head holds of the ? Who",
        "the department of serving as the ? you head Can individual Chemistry identify the",
        "in the hod of is jssstu chemistry who",
        "chemistry branch in Name of department head the",
        "is who of department head of jssstu in the chemistry",
        "What chemistry name the hod is of the",
        "head department of chemistry in Name the branch",
        "? currently of the the Who of Chemistry Department the Head holds position",
        "who is the head of department of chemistry in jssstu",
        "role the occupying head ? department name the What the of currently of is person the Chemistry",
        "department of is chemistry Who the HOD",
        "Who ? the Department of position Chemistry the the holds Head of currently",
        "who is the hod of chemistry in jssstu ",
        "is of HOD department the chemistry Who",
        "hod of in the is chemistry jssstu who",
        "Could you provide information about the current Head of the Chemistry Department?",
        "HOD is of chemistry department the Who",
        "holds Chemistry of Department the the position ? Head currently Who the of"
      ],
      "responses": [
        "Dr. P Mallu is the Head of the Chemistry department.",
        "The current Head of the Chemistry department is Dr. P Mallu.",
        "Dr. P Mallu holds the position of Head of the Chemistry department.",
        "The hod of the Chemistry department is Dr. P Mallu."
      ]
    },
    {
      "tag": "physicsHOD",
      "patterns": [
        "of ? individual the department you serving head Can the as identify the Physics",
        "of is physics department Who HOD the",
        "of you the Physics about current ? Department Head information Could the provide",
        "Can the you the individual serving as ? department identify of the Physics head",
        "branch Name in head department of the physics",
        "head is jssstu of in physics who department of the",
        "provide information about Head ? the the you Could of Department current Physics",
        "What the the physics hod name is of",
        "jssstu in is who physics of head of department the",
        "is person currently the occupying Physics the ? name of department of head the What role the",
        "What is the name of the physics hod",
        "is head the department physics who in jssstu of of",
        "the name physics What the is of hod",
        "Department Physics provide the you about information of current the ? Head Could",
        "the is department role ? person currently the name head of the Physics What of occupying the",
        "name physics hod the of the What is",
        "Who is the HOD of physics department",
        "the hod is What of physics name the",
        "individual Can Physics of the head serving you the the ? identify department as",
        "department physics the is of HOD Who",
        "of department in Name branch head the physics",
        "serving ? identify head Can department you individual the Physics as of the the",
        "of Head current ? Department the you the provide Could Physics information about",
        "of the role currently the What person the the head department is ? Physics name occupying of",
        "who is the head of department of physics in jssstu",
        "Can you identify the individual serving as the head of the Physics department?",
        "? department person the of name of currently is Physics head role the the What occupying the",
        "department physics Who HOD is of the",
        "the of Name department branch physics in head",
        "of jssstu who physics hod is the in",
        "branch head physics in Name department the of",
        "who is the hod of physics in jssstu ",
        "department in of head is the who physics of jssstu",
        "Who currently holds the position of the Head of the Physics Department?",
        "Name the head of department in physics branch",
        "jssstu is of in the physics hod who",
        "the Physics Who of holds Department of the position the ? currently Head",
        "of is physics the name the hod What",
        "who is in physics jssstu of the hod",
        "of Department Who Physics the Head the the ? currently holds of position",
        "the physics of department HOD Who is",
        "physics branch Name head department of in the",
        "? of person role the Physics the the is occupying name the currently What department head of",
        "Head Physics you of Department information current the ? the provide Could about",
        "position of Department currently of the holds Head the Who the ? Physics",
        "Department Who the currently position ? of the of holds the Physics Head",
        "Department holds Head the the of currently position Physics the Who ? of",
        "of the who physics is hod jssstu in",
        "Could you provide information about the current Head of the Physics Department?",
        "What is the name of the person currently occupying the role of the Physics department head?",
        "individual the serving the as you ? identify Physics the department head of Can",
        "the in hod jssstu who is physics of",
        "physics in of is of the who jssstu head department",
        "Who of department HOD the is physics"
      ],
      "responses": [
        "Mr. Mahadeva Prasad P is the Head of the Physics Department.",
        "The Head of the Physics Department is Mr. Mahadeva Prasad P.",
        "Mr. Mahadeva Prasad P is currently serving as the Head of the Physics Department.",
        "Mr. Mahadeva Prasad P is currently serving as the Head of the Physics Department."
      ]
    },
    {
      "tag": "CTMHOD",
      "patterns": [
        "who jssstu CTM is head department the in of of",
        "Could the about you Department current Head CTM the provide of information ?",
        "Who is the HOD of CTM department",
        "Who holds currently the of position the Head CTM the ? Department of",
        "the Head about Department of Could current the ? provide CTM information you",
        "Name the head of department in CTM branch",
        "the the Department Who the of CTM holds Head of ? position currently",
        "CTM Who of is department the HOD",
        "What is the name of the person currently occupying the role of the CTM department head?",
        "the the as head ? department CTM individual identify of the you serving Can",
        "Who currently holds the position of the Head of the CTM Department?",
        "department of the is in jssstu CTM head who of",
        "currently the the person ? is department What of name the head role the of occupying CTM",
        "Could you provide information about the current Head of the CTM Department?",
        "you of head individual Can CTM as ? the the serving the identify department",
        "is What name the of hod CTM the",
        "the holds of Head currently Who ? of Department position the CTM the",
        "branch of Name the in CTM head department",
        "department of head in CTM Name the branch",
        "the of holds Who position CTM the the currently Head of Department ?",
        "the role of head the ? name person What CTM currently occupying the the department is of",
        "hod who is of in CTM the jssstu",
        "the hod is jssstu CTM of who in",
        "the ? individual as serving the you of CTM Can head the identify department",
        "hod of the CTM the What name is",
        "branch department the head CTM Name of in",
        "who is the hod of CTM in jssstu ",
        "Can you identify the individual serving as the head of the CTM department?",
        "of HOD the department CTM Who is",
        "? name What the the the of is currently of role department the head person occupying CTM",
        "department of of is jssstu CTM in head who the",
        "Can identify the department the the of head individual ? serving you as CTM",
        "about of ? Department Head CTM you the the information provide Could current",
        "department CTM Name the in head of branch",
        "What hod the name the is CTM of",
        "jssstu in the of is CTM hod who",
        "the CTM in who of of head jssstu is department",
        "name hod CTM of the What the is",
        "head CTM in who jssstu department of is the of",
        "CTM Who the is HOD of department",
        "jssstu who the is in CTM hod of",
        "holds of Head position the Who Department ? CTM currently the of the",
        "is jssstu in the CTM hod of who",
        "Name department branch in head the of CTM",
        "the the ? the department person is occupying role CTM head name of of the currently What",
        "serving CTM as department head the ? individual you of Can the identify the",
        "the Head CTM you Department of Could current information the provide ? about",
        "the CTM What hod of name the is",
        "the What the person department the name of role occupying ? the of is currently CTM head",
        "who is the head of department of CTM in jssstu",
        "HOD Who department CTM of the is",
        "What is the name of the CTM hod",
        "department of is HOD CTM Who the",
        "CTM the ? you Could of Department about Head the information current provide"
      ],
      "responses": [
        "Dr. Nagabhushana is the hod of the Construction Technology and Management department.",
        "The Head of the Department (HOD) for Construction Technology and Management is Dr. Nagabhushana.",
        "Dr. Nagabhushana serves as the hod of the Construction Technology and Management department.",
        "Dr. Nagabhushana is currently the Head of the Department for Construction Technology and Management."
      ]
    },
    {
      "tag": "biotechHOD",
      "patterns": [
        "the biotechnology name the of hod is What",
        "department the branch Name head of in biotechnology",
        "Name the head of department in biotechnology branch",
        "of biotechnology branch department the Name in head",
        "about information Head the of Department the Biotechnology current you ? provide Could",
        "What is the name of the person currently occupying the role of the Biotechnology department head?",
        "? the identify the you Can serving Biotechnology of individual department as head the",
        "in the Name head branch biotechnology department of",
        "head of branch biotechnology Name department the in",
        "is the of hod in who biotechnology jssstu",
        "What is the name of the biotechnology hod",
        "Head the ? currently holds the Department Biotechnology the of position of Who",
        "as ? the Biotechnology the head the of identify serving Can you individual department",
        "head role the of the Biotechnology department the the occupying currently ? of person name is What",
        "is biotechnology the department Who HOD of",
        "Who is the HOD of biotechnology department",
        "name the hod of What is biotechnology the",
        "information Department the Biotechnology Could about of Head you current provide the ?",
        "Department the Head the ? the holds Who currently Biotechnology of of position",
        "the holds of currently Head Department the ? position of the Biotechnology Who",
        "head Name of in the biotechnology department branch",
        "who is the head of department of biotechnology in jssstu",
        "of of head Biotechnology the currently the the the role name person occupying department is ? What",
        "the jssstu of is department head of in biotechnology who",
        "of hod biotechnology name is What the the",
        "is department biotechnology the of Who HOD",
        "who is the hod of biotechnology in jssstu ",
        "Department holds the Who Biotechnology of of currently position Head the ? the",
        "department role person the is head Biotechnology of the currently of the What the ? occupying name",
        "Biotechnology position of holds ? Head currently the Who of the the Department",
        "of the head currently ? What Biotechnology of the the the department is role name occupying person",
        "the ? Could Biotechnology about Head of information current you the Department provide",
        "Who currently holds the position of the Head of the Biotechnology Department?",
        "the person the occupying head of the is role the What of ? currently name department Biotechnology",
        "hod who the jssstu in is biotechnology of",
        "department Who HOD is biotechnology of the",
        "provide current Head about Biotechnology Department information Could ? the you of the",
        "biotechnology in is head of the jssstu of department who",
        "department biotechnology is the HOD of Who",
        "of the biotechnology is hod jssstu in who",
        "Biotechnology head as individual serving the of ? the department you Can identify the",
        "the in is of hod who biotechnology jssstu",
        "department of is in jssstu the head biotechnology of who",
        "Can you identify the individual serving as the head of the Biotechnology department?",
        "Could you provide information about the current Head of the Biotechnology Department?",
        "head biotechnology the jssstu who in of department of is",
        "head of the in biotechnology department jssstu who is of",
        "of ? Head Department the Could provide Biotechnology current about you information the",
        "? Can individual of you department serving the Biotechnology the as head identify the",
        "biotechnology the name is hod of What the",
        "individual as ? department of head Can the the identify the you Biotechnology serving",
        "the the of name biotechnology is hod What",
        "jssstu biotechnology hod is of the who in",
        "is the HOD of Who biotechnology department"
      ],
      "responses": [
        "Dr. K.R. Sanjay is the Head of the Biotechnology department.",
        "The current Head of the Biotechnology department is Dr. K.R. Sanjay.",
        "Dr. K.R. Sanjay is currently the Head of the Biotechnology department.",
        "The Head of the Biotechnology department is Dr. K.R. Sanjay."
      ]
    },
    {
      "tag": "IPHOD",
      "patterns": [
        "IP in head of department Name the branch",
        "who is the jssstu IP hod of in",
        "IP head of is of who in the department jssstu",
        "department the in the Department of ? charge the Production is Who and of as Industrial Head",
        "in is who of jssstu hod the IP",
        "the in head branch IP Name department of",
        "Could you provide information about the current Head of the IP Department?",
        "Who currently holds the position of Head of the Department (HOD) for Industrial and Production?",
        "the ? of the the role name occupying person What department currently head IP the of is",
        "Head ? the the currently Who Department holds the of of position IP",
        "the is the name hod What IP of",
        "( position Industrial Production and of currently Department ? HOD for the the ) Head Who holds of",
        "is of IP the Who department HOD",
        "name IP the What hod is of the",
        "Who currently holds the position of the Head of the IP Department?",
        "as department the ? head the serving identify individual of you the Can IP",
        "who head jssstu is IP in of the of department",
        "? information Head the of about IP you current Could Department the provide",
        "provide Department Could the of you current IP about ? information the Head",
        "person ? role the department occupying currently head is of name the of the What IP the",
        "HOD Industrial the Production name and Could ? the the share you of department for",
        "the identify you the IP ? serving of Can individual head as the department",
        "department is of of the the and Department Head Industrial charge Production the in ? as Who",
        "IP head of in Name branch department the",
        "Can you identify the individual serving as the head of the IP department?",
        "of in is hod who IP jssstu the",
        "who is the hod of IP in jssstu ",
        "of and the the department Could ? Production name the you share for Industrial HOD",
        "current provide the you about Can HOD department and Industrial of the information ? Production",
        "head Can of the the ? you department individual IP identify the serving as",
        "currently is head person the IP department What ? role the occupying the name the of of",
        "the of name the What is hod IP",
        "Department Could Head information IP current the the provide of you about ?",
        "the IP hod is of who jssstu in",
        "HOD the is department Who IP of",
        "head of Name department in the IP branch",
        "the jssstu in hod of IP is who",
        "the person the department currently role of ? occupying IP name What head the of is the",
        "What is the name of the IP hod",
        "of in Production ? is the the Who and department of Head the Industrial charge as Department",
        "of the Department ? Head position currently Who of IP the the holds",
        "IP ? Who Head Department the of holds the currently of the position",
        "Industrial ? Production and department Could the you the for share HOD of name the",
        "for ? the Head of ( Industrial Who holds HOD Production position Department and of currently ) the",
        "Who is the HOD of IP department",
        "Name the head of department in IP branch",
        "who head in jssstu the IP of is department of",
        "of ? the currently the IP position Department Who of the Head holds",
        "Head HOD of position for currently Production the ( Department ) holds of and ? the Industrial Who",
        "Department information Could IP you Head about the current the of provide ?",
        "the Department ? Industrial charge and the Production the Head in of as is department Who of",
        "of the Can you Industrial HOD provide and information current the ? department about Production",
        "and Could name of the HOD you ? Production for the department Industrial share the",
        "Can HOD provide Production information about and the of current Industrial ? the department you",
        "the of the name What is IP hod",
        "department you and HOD the current about provide ? of Production Industrial information the Can",
        "Could the the you HOD and department share of ? the name Industrial Production for",
        "holds the Department of position for Production the ( HOD ? Who Industrial currently ) Head of and",
        "department IP head of of jssstu the in is who",
        "of currently Who and position Production for of HOD Department holds the ( Head ) the Industrial ?",
        "department the as you IP Can identify individual serving of ? head the the",
        "What is the name of the person currently occupying the role of the IP department head?",
        "IP identify Can you the the serving the as ? individual department of head",
        "provide IP you about current Department ? the Head Could the of information",
        "is the hod name What IP of the",
        "department name role person What currently the head the IP occupying ? the of of the is",
        "who is the head of department of IP in jssstu",
        "IP department Who of the HOD is",
        "Could you share the name of the HOD for the Industrial and Production department?",
        "branch the head Name department in of IP",
        "the holds currently ? of Department position the Head the of IP Who",
        "Can you provide information about the current HOD of the Industrial and Production department?",
        "Who is in charge of the Industrial and Production department as the Head of the Department?",
        "of jssstu IP the department of is head who in",
        "current about the Can provide ? and HOD the department you information Production of Industrial",
        "department IP Who HOD of is the",
        "is Who department HOD the IP of",
        "Production of department the is as and charge the in Department Industrial the of Who Head ?"
      ],
      "responses": [
        "Dr. Savitha M is the HOD of the Industrial and Production department.",
        "The HOD of the Industrial and Production department is Dr. Savitha M.",
        "Dr. Savitha M currently serves as the Head of the Department (HOD) for Industrial and Production.",
        "Dr. Savitha M is the current HOD of the Industrial and Production department."
      ]
    },
    {
      "tag": "EEEHOD",
      "patterns": [
        "information Electrical Head of department provide the and about you Electronics Can current the ?",
        "the the EEE name What is hod of",
        "HOD EEE department of the Who is",
        "Head is of department and Electronics as Electrical charge in ? Who the the",
        "Could you provide information about the current Head of the EEE Department?",
        "the of is the currently the occupying the person head role ? department name EEE What of",
        "is occupying of the the EEE role currently What head person department the the of name ?",
        "who is the hod of EEE in jssstu ",
        "department Head Electrical Electronics is of the as and in Who ? the charge",
        "position currently Head of ? holds of the EEE the Who Department the",
        "of role name EEE the is What the head department occupying the ? currently of the person",
        "leading is Electronics as and person What name the department ? of Electrical Head the the the",
        "the is of hod jssstu EEE in who",
        "provide you current Head of ? and Electrical information the Electronics the department about Can",
        "What is the name of the EEE hod",
        "Head department of the as Electronics ? and in is Electrical Who charge the",
        "What is the name of the person leading the Electrical and Electronics department as the Head?",
        "information Head Could ? about Department provide current of you the EEE the",
        "branch Name in the head department of EEE",
        "person department Electrical the Electronics ? What and leading is the name Head the as of the",
        "the department EEE person the is occupying head the currently the role of of name What ?",
        "Who currently holds the position of Head of the Electrical and Electronics department?",
        "department the Can serving as the individual the ? of head identify EEE you",
        "of is head department who jssstu the EEE in of",
        "What EEE is the name of the hod",
        "of currently Head Who ? and the holds of Electrical department the position Electronics",
        "hod What is of name the EEE the",
        "Electrical of of currently Electronics and the Who ? the position Head holds department",
        "of of is jssstu EEE who department head the in",
        "the currently Electrical ? Who and department Electronics position of holds of the Head",
        "the currently holds Head the of position Electronics department Electrical of Who and ?",
        "Can Electronics Head and ? provide department current information you the the of Electrical about",
        "the name the of EEE is What hod",
        "the name the person department of and the What Electronics Electrical the leading Head ? as is",
        "Department information ? you the provide of Head EEE Could current the about",
        "of as department you identify the serving Can individual the the EEE head ?",
        "of EEE of the jssstu is department head who in",
        "Department of the Head Could about current ? provide you EEE the information",
        "the Electrical and as the What of Head ? the name is the Electronics department leading person",
        "who is the head of department of EEE in jssstu",
        "of Electronics department What leading and as person Electrical Head the the the the is name ?",
        "Who currently holds the position of the Head of the EEE Department?",
        "information the current of Head Could about you Department provide ? EEE the",
        "Who is in charge of the Electrical and Electronics department as the Head?",
        "in branch EEE of the Name head department",
        "of and in department Electrical is Electronics ? Head as charge Who the the",
        "EEE individual of identify head ? the department the serving the you Can as",
        "Head you current ? provide of Could the the Department information EEE about",
        "about Head Electrical information department Can of the current provide Electronics the you and ?",
        "in branch EEE Name head the department of",
        "? you of Can Head Electrical about provide current the information department Electronics the and",
        "Name the head of department in EEE branch",
        "Can you provide information about the current Head of the Electrical and Electronics department?",
        "as head ? the Can you of EEE individual department serving the identify the",
        "jssstu EEE in of who hod is the",
        "department who EEE head jssstu is of the in of",
        "the of currently ? Department the holds of Who Head the position EEE",
        "Electrical ? currently Who position the of Electronics and of holds the Head department",
        "Who is the HOD of EEE department",
        "role the department head the What occupying of currently EEE the of person ? is name the",
        "holds Department ? of the the of EEE Who position currently Head the",
        "is Who department of EEE HOD the",
        "EEE department the in of jssstu of head who is",
        "Who of EEE department is the HOD",
        "Who HOD of EEE is the department",
        "of the in who hod is EEE jssstu",
        "in EEE head of Name branch department the",
        "is EEE the name the What hod of",
        "What is the name of the person currently occupying the role of the EEE department head?",
        "in of head department branch the EEE Name",
        "identify serving head Can department individual you the EEE ? as the the of",
        "Head Electrical of department charge the as is Electronics Who in the and ?",
        "Department currently of Head of the ? holds the the Who EEE position",
        "EEE of department HOD is Who the",
        "Can you identify the individual serving as the head of the EEE department?",
        "the holds ? of EEE the of Who position Head currently the Department",
        "the hod jssstu is in EEE of who",
        "is of EEE hod who jssstu the in"
      ],
      "responses": [
        "Dr. Sidram M H serves as the Head of the Electrical and Electronics department.",
        "The current Head of the Electrical and Electronics department is Dr. Sidram M H.",
        "Dr. Sidram M H is the Head of the Electrical and Electronics department.",
        "The Head of the Electrical and Electronics department is Dr. Sidram M H."
      ]
    },
    {
      "tag": "EIHOD",
      "patterns": [
        "Who is in charge of the Electronics and Instrumentation department as the Head?",
        "Could you provide information about the current Head of the EI Department?",
        "information you provide of Department EI current the about ? Could Head the",
        "department charge as Instrumentation in Who the Electronics the is ? and Head of",
        "position Head holds of the Who the Department of EI ? currently the",
        "in is hod who of jssstu EI the",
        "of the EI Who HOD is department",
        "Can you provide information about the current Head of the Electronics and Instrumentation department?",
        "is Who HOD EI of the department",
        "Who is the HOD of EI department",
        "name is of person of the the head role ? occupying the department the EI What currently",
        "of as Instrumentation and the Who charge Head ? in Electronics department is the",
        "position of the the of EI ? Who Head the Department currently holds",
        "who is the hod of EI in jssstu ",
        "department as leading ? the is of the What the Head the person name Instrumentation Electronics and",
        "holds of Electronics and of the Instrumentation the ? position Head Who currently department",
        "the information provide and Electronics you about the Instrumentation Can of ? Head current department",
        "about Head the you the Can information Electronics ? and of Instrumentation department current provide",
        "name the Electronics the What the person ? is of department Instrumentation leading the and as Head",
        "What is the name of the person leading the Electronics and Instrumentation department as the Head?",
        "? Electronics position and of holds Head department the of Who Instrumentation currently the",
        "department you the the as Can individual head of the ? identify EI serving",
        "What is the name of the EI hod",
        "the of occupying currently ? the role head of is the the department person name EI What",
        "EI Name in of department branch head the",
        "? currently head is role of the the the department occupying the EI What of name person",
        "EI the is department of HOD Who",
        "about Could EI provide you the ? the Head current of Department information",
        "Head about EI current of the ? Could you the provide Department information",
        "Electronics person the the and Instrumentation What name the leading is as of the ? Head department",
        "person the of the as leading What Electronics ? the name the department Head and is Instrumentation",
        "the in who is hod EI jssstu of",
        "the Electronics ? Who the of position currently department Head Instrumentation of and holds",
        "of head department you EI the Can serving as ? identify individual the the",
        "of EI is the in who jssstu hod",
        "who is the head of department of EI in jssstu",
        "of Instrumentation the position and Who holds currently Electronics ? department the of Head",
        "branch the EI Name of department in head",
        "of branch the Name department head EI in",
        "Head of of position Department currently holds the the ? Who EI the",
        "of head branch in department EI the Name",
        "Who is the Electronics of in and department Head charge Instrumentation ? the as",
        "of the EI is name What the hod",
        "is the name the What of hod EI",
        "the EI Department information about of current the Could you provide ? Head",
        "who jssstu the hod of EI in is",
        "the about and Can department Head you of ? current the Electronics Instrumentation information provide",
        "jssstu EI is hod the in who of",
        "? Who the EI currently of of the the Department Head position holds",
        "Head the What leading Instrumentation person is the of as name department ? the and Electronics the",
        "the is of name hod What the EI",
        "the in who jssstu of head of is EI department",
        "is jssstu of head who department EI of the in",
        "position the of of ? holds Electronics currently Instrumentation Who and department Head the",
        "department in Head of Instrumentation the is and Who as the charge ? Electronics",
        "EI is the department Who HOD of",
        "charge ? department as in Instrumentation and of Head is the Who the Electronics",
        "of ? Who of Head position the the holds Department EI currently the",
        "you and information the Head Instrumentation about of provide Can ? the Electronics department current",
        "EI hod of What the the is name",
        "provide the about of current EI information Head ? Department you the Could",
        "of the department provide about ? the Instrumentation Head Electronics you Can information current and",
        "Who currently holds the position of the Head of the EI Department?",
        "is the role the ? occupying department of of the What head EI name the currently person",
        "Name the head of department in EI branch",
        "department head the the serving as the Can individual EI you ? identify of",
        "the EI department as of individual identify the serving head you ? Can the",
        "Who currently holds the position of Head of the Electronics and Instrumentation department?",
        "? the of What name department the the currently is head of occupying person the role EI",
        "head the department you Can as the the individual identify ? EI serving of",
        "in the of department jssstu head of EI who is",
        "the is EI name the hod What of",
        "of jssstu is of who department in EI head the",
        "Can you identify the individual serving as the head of the EI department?",
        "What is the name of the person currently occupying the role of the EI department head?",
        "department of EI is Who HOD the",
        "in of the EI branch Name department head",
        "department in EI the is who head jssstu of of"
      ],
      "responses": [
        "Dr. K Umarani is the Head of the Department (HOD) for the Electronics and Instrumentation department.",
        "Dr. K Umarani serves as the Head of the Department (HOD) for Electronics and Instrumentation.",
        "The current Head of the Department (HOD) for Electronics and Instrumentation is Dr. K Umarani.",
        "Dr. K Umarani is the designated Head of the Department (HOD) for Electronics and Instrumentation."
      ]
    },
    {
      "tag": "MBAHOD",
      "patterns": [
        "in hod is MBA who of the jssstu",
        "Could provide the the ? current of MBA information Head you Department about",
        "MBA the What name is the hod of",
        "Who is the HOD of MBA department",
        "Who currently holds the position of the Head of the MBA Department?",
        "who of department head of in is MBA the jssstu",
        "head the of in is MBA department who jssstu of",
        "branch MBA of Name head in the department",
        "of the ? the Head Who position the Department holds MBA currently of",
        "the of MBA in department Name head branch",
        "department HOD Who MBA the of is",
        "MBA What of the name the hod is",
        "the position Head the of holds MBA currently Who of the ? Department",
        "the person ? occupying head role of name the department What MBA currently the is of the",
        "Could Department about provide ? information of the MBA you current Head the",
        "of What name MBA is the the hod",
        "current of you Head the ? MBA provide about Department information Could the",
        "Can you identify the individual serving as the head of the MBA department?",
        "serving you MBA head ? the as individual identify department of the the Can",
        "MBA of is jssstu in who the hod",
        "you as ? identify department of serving MBA the Can head the the individual",
        "the MBA of holds currently ? the Who the of Department Head position",
        "you department serving head the the Can as of individual the MBA identify ?",
        "of hod who jssstu the in is MBA",
        "of is HOD Who department the MBA",
        "is of jssstu MBA department of the who head in",
        "Name head department in the branch MBA of",
        "MBA of Department the you ? about current provide information Head Could the",
        "in the head MBA Name department branch of",
        "MBA department is of HOD the Who",
        "What is the name of the person currently occupying the role of the MBA department head?",
        "is MBA who the of hod jssstu in",
        "What is the name of the MBA hod",
        "in branch MBA department the Name of head",
        "the is who jssstu of head MBA of in department",
        "who is the head of department of MBA in jssstu",
        "hod who is jssstu in the MBA of",
        "the of role the ? the head person is currently department name What MBA of occupying the",
        "is head department who MBA in of jssstu the of",
        "who is the hod of MBA in jssstu ",
        "the occupying department name role the currently person head of the What of MBA ? is the",
        "the What MBA of is name hod the",
        "information you Could the of current ? the MBA Head Department provide about",
        "department identify head you the ? serving MBA the as the Can individual of",
        "the Who of holds position the Department ? the of MBA Head currently",
        "the MBA of is name What hod the",
        "of ? the MBA you as individual the department Can head identify serving the",
        "MBA Who of is the HOD department",
        "position currently of ? Who the holds MBA Department of Head the the",
        "? department the MBA role the head of occupying currently of person the name is the What",
        "Could you provide information about the current Head of the MBA Department?",
        "Who MBA is the department of HOD",
        "currently the the person the is department of name ? role head MBA of occupying the What",
        "Name the head of department in MBA branch"
      ],
      "responses": [
        "Dr. Swaroop Simha serves as the Head of the MBA department.",
        "The current Head of the MBA department is Dr. Swaroop Simha.",
        "Dr. Swaroop Simha is the designated Head of the MBA department.",
        "The Head of the MBA department is Dr. Swaroop Simha."
      ]
    },
    {
      "tag": "ECHOD",
      "patterns": [
        "the name What EC of department occupying the currently ? person is of the role the head",
        "Who department the Communication Head and is in of as the charge Electronics ?",
        "the of EC of holds position Who currently Head ? Department the the",
        "Could you provide information about the current Head of the EC Department?",
        "is EC who of hod jssstu in the",
        "Who department HOD the is of EC",
        "of position Communication of Who holds currently the department the ? Electronics and Head",
        "about ? current you of the and information Electronics provide department Head Can the Communication",
        "information provide Communication Electronics department about the ? and the of you Head Can current",
        "of department Name in EC head the branch",
        "provide the current Could Department about ? information you the of Head EC",
        "HOD is department EC the of Who",
        "who is the head of department of EC in jssstu",
        "What is the name of the person leading the Electronics and Communication department as the Head?",
        "Head the ? the the position Department currently holds of Who of EC",
        "individual department identify EC ? as the serving Can of the the head you",
        "the EC of Head Who Department ? the position the of currently holds",
        "Who is in charge of the Electronics and Communication department as the Head?",
        "who is the hod of EC in jssstu ",
        "the Electronics the Communication person What the and is ? department Head as name leading of the",
        "of hod name is the EC the What",
        "of EC is jssstu the in who hod",
        "What is the name of the EC hod",
        "Department Could you ? the Head about information of EC provide the current",
        "hod EC the of name What the is",
        "of department of occupying name currently head the person What EC the the ? the role is",
        "jssstu head who the of is department EC in of",
        "the the as What leading department Communication the the and person of Head name ? Electronics is",
        "Can you identify the individual serving as the head of the EC department?",
        "of jssstu hod the in EC who is",
        "jssstu of who hod in the is EC",
        "of jssstu is in head of who the department EC",
        "Communication the is the charge of department Who and in ? Electronics as Head",
        "? in charge Communication the Head department and of as is Who the Electronics",
        "EC of who is head of the in department jssstu",
        "Name the head of department in EC branch",
        "currently the of EC Head Who holds position the Department the of ?",
        "of position Electronics Head Who and of Communication the department currently holds the ?",
        "you department of Can the identify EC the the individual as head serving ?",
        "Who currently holds the position of the Head of the EC Department?",
        "the Can ? of the identify individual EC as department head the serving you",
        "is name the of currently EC department of the the What role ? person the occupying head",
        "name the hod of the What EC is",
        "is the as Electronics department What person leading the of name Communication Head and the ? the",
        "the EC What name the of is hod",
        "individual the the identify EC of department ? Can the head serving you as",
        "jssstu who in department the is of head EC of",
        "Communication the is Electronics department ? What name of as the the Head leading and the person",
        "currently name of the person department head is occupying role the of the EC the What ?",
        "of is in and the as Electronics Communication Who charge department Head the ?",
        "? holds Department EC Head of the the of position currently Who the",
        "department and the charge as of Electronics in the Who Head Communication is ?",
        "current ? department the the Can provide information about you of Electronics Communication Head and",
        "EC is of department Who the HOD",
        "Who and of Electronics currently the ? of Communication the holds position Head department",
        "the EC is the hod of What name",
        "Name the of EC branch department head in",
        "Who is the HOD of EC department",
        "of the the as leading name and the ? What department person Communication the is Head Electronics",
        "EC the about provide you ? the Department of information Could Head current",
        "? provide Department current information you the of about EC Head Could the",
        "current Communication the about provide Head ? information and Electronics of the Can department you",
        "information provide of current and you Electronics the ? Communication the Head department Can about",
        "Who HOD department of EC the is",
        "jssstu is EC department who of the head of in",
        "Communication holds the ? position Who of the and department Head currently of Electronics",
        "Who currently holds the position of Head of the Electronics and Communication department?",
        "of the head in branch Name EC department",
        "department ? name of the head role occupying is EC the the What the person currently of",
        "Can you provide information about the current Head of the Electronics and Communication department?",
        "Electronics holds position Head ? of of Who the currently and department the Communication",
        "What is the name of the person currently occupying the role of the EC department head?",
        "in of EC the department branch Name head",
        "of Who department the HOD EC is",
        "EC the of is in jssstu hod who",
        "Department the EC ? you Head current provide information the of Could about",
        "as department the serving of ? EC head individual identify Can you the the",
        "in the department head of Name branch EC"
      ],
      "responses": [
        "Dr. U B Mahadevaswamy is the hod of the Electronics and Communication department.",
        "The hod of the Electronics and Communication department is Dr. U B Mahadevaswamy.",
        "Dr. U B Mahadevaswamy serves as the hod of the Electronics and Communication department.",
        "The head of the Electronics and Communication department is Dr. U B Mahadevaswamy."
      ]
    },
    {
      "tag": "coursesOffered",
      "patterns": [
        "? What are the educational opportunities institution available at",
        "Could you list the different types of courses offered at the institution?",
        "Which courses are available at the institution?",
        "the different list institution of the types at offered ? courses Could you",
        "available institution courses are at Which the ?",
        "provide ? types courses Can about of the offered you information",
        "Could of offered at ? the list different courses you types the institution",
        "courses types offered Could institution ? different list you the of at the",
        "of courses Can types offered you the ? information about provide",
        "Could institution list offered at the different ? types of the you courses",
        "What educational opportunities are available at the institution?",
        "? courses available institution are the Which at",
        "provide you offered about types information ? the Can courses of",
        "are ? institution the Which courses at available",
        "educational at opportunities What are the ? available institution",
        "? are institution What available opportunities educational the at",
        "courses types of list Could at institution the you different offered the ?",
        "courses at available ? the Which are institution",
        "Can you provide information about the types of courses offered?",
        "offered about ? the you information of provide courses types Can",
        "? types of the you courses Can information about offered provide",
        "at are ? Which available institution courses the",
        "What educational at the institution are ? opportunities available",
        "institution at educational the What are opportunities ? available"
      ],
      "responses": [
        "The institution offers a range of courses, including Undergraduate (UG), Postgraduate (PG), and research opportunities.",
        "Courses at the institution encompass Undergraduate (UG), Postgraduate (PG), and research opportunities.",
        "The institution provides educational opportunities through Undergraduate (UG), Postgraduate (PG), and research programs.",
        "The courses offered at the institution include Undergraduate (UG), Postgraduate (PG), and opportunities for research."
      ]
    },
    {
      "tag": "antiRagging",
      "patterns": [
        "ragging are the of address How measures does and , taken campus the issue what ?",
        "place ? in What ragging college in are initiatives the to curb",
        "ragging issue of address the measures ? , campus and taken are what the How does",
        "What institution name committee at of the the is anti-ragging ? the",
        "campus of the ragging , ? the How taken what and address issue measures does are",
        "What to measures place campus in on ? ragging the prevent are",
        "a there ? institution at ragging committee the to Is prevent",
        "Could you provide information about the anti-ragging committee at the institution?",
        "the ragging committee at there Is institution ? to prevent a",
        "How does the campus address the issue of ragging, and what measures are taken?",
        "campus on the ragging What to place measures in prevent are ?",
        "the committee ? is at of the the name anti-ragging institution What",
        "What measures are in place to prevent ragging on the campus?",
        "? there the institution anti-ragging Is at committee an",
        "ragging ? measures , How does address what are issue of the the campus taken and",
        "the the at anti-ragging institution is name committee of the ? What",
        "taken to prevent ? steps Can elaborate within campus on the ragging you the",
        "Is anti-ragging ? committee at institution the there an",
        "anti-ragging information institution about Could the the at provide committee ? you",
        "What is the name of the anti-ragging committee at the institution?",
        "initiatives place in curb What the ? to in are ragging college",
        "issue , campus taken ragging are the measures the and address of what ? How does",
        "What initiatives are in place to curb ragging in the college?",
        "Can on the the prevent ragging taken you to campus elaborate ? within steps",
        "measures the campus to prevent ragging are What in place on ?",
        "campus within you the ragging ? taken steps Can elaborate to the on prevent",
        "the name of What institution ? anti-ragging is the the at committee",
        "in place the in college ? are initiatives ragging What to curb",
        "Is there a committee to prevent ragging at the institution?",
        "about the at institution committee provide ? you Could anti-ragging the information",
        "the prevent institution ragging at to a ? there committee Is",
        "elaborate campus ragging to within steps on prevent taken ? the you the Can",
        "institution the anti-ragging committee ? an Is at there",
        "the Could the information anti-ragging institution ? about provide committee you at",
        "at the What is institution of the name anti-ragging committee ? the",
        "Could at the you about information committee anti-ragging the ? provide institution",
        "the at institution ? a prevent ragging Is committee there to",
        "within ? campus to elaborate on prevent the taken Can ragging steps the you",
        "the anti-ragging at ? there an Is institution committee",
        "the prevent in measures ? on What are to place ragging campus",
        "there at prevent to ? committee Is institution the ragging a",
        "? anti-ragging the about the at institution information you provide committee Could",
        "to are ragging place on campus measures in ? prevent What the",
        "Is there an anti-ragging committee at the institution?",
        "? What curb to are ragging the in place initiatives in college",
        "Can you elaborate on the steps taken to prevent ragging within the campus?",
        "committee institution ? at an anti-ragging the Is there",
        "What place ? in initiatives ragging college to are in curb the"
      ],
      "responses": [
        "The campus has established an anti-ragging committee and anti-ragging squads, comprising the Principal, Vice principal, senior professors, administrative staff, Warden, resident wardens, assistant wardens, and the Student Welfare Officer (SWO). These measures aim to prevent any harassment of freshmen in the college premises or hostels.",
        "To prevent any form of ragging, the campus has instituted an anti-ragging committee and anti-ragging squads, which include the Principal, Vice principal, senior professors, administrative staff, Warden, resident wardens, assistant wardens, and the Student Welfare Officer (SWO). This comprehensive approach ensures the safety of freshmen in both college premises and hostels.",
        "The college has implemented a robust system against ragging, featuring an anti-ragging committee and anti-ragging squads. Comprising key members such as the Principal, Vice principal, senior professors, administrative staff, Warden, resident wardens, assistant wardens, and the Student Welfare Officer (SWO), these measures are designed to prevent any harassment of newcomers within the college premises or hostels.",
        "To address the issue of ragging, the campus has established an anti-ragging committee and anti-ragging squads. These include the Principal, Vice principal, senior professors, administrative staff, Warden, resident wardens, assistant wardens, and the Student Welfare Officer (SWO). The purpose is to ensure that newcomers are not subjected to any form of harassment, be it within the college premises or hostels."
      ]
    }
  ]
}